{"title":"One Startup’s Struggle to Survive the Silicon Valley Gold Rush",
"author":"Gideon Lewis-Kraus",
"url":"http://www.wired.com/2014/04/no-exit",
"content":"It was an unseasonably warm December, and somewhere nearby a rising tide in the San Francisco Bay was lifting all kite-surfers, but Nick Edwards and Chris Monberg were crouched at opposite rented desks in a shared coworking space near the Caltrain station in SoMa wondering if, by the middle of February, they would still have a company. At the moment Boomtrain, as the startup was called, technically had something like negative dollars, because it owed the state of New York a $30,000 fine after its payroll company had been six weeks late in telling them about a $400 unemployment-insurance bill for one of their remote engineers. Boomtrain also had no revenue, though that was hardly a hurdle to raising investment capital in Silicon Valley. Somewhat more problematically, it didn’t have a single customer, though there were several pilots in the wings. Almost inadvertently, Nick and Chris had found themselves building a business of enormous complexity—a personalization engine, based on machine-learning algorithms—and they were in over their heads.| Neither man was having an easy time keeping it together. Chris was waking up every morning at 5 am grinding his teeth, and Nick’s belt was clearly two notches tighter than usual. They had not taken paychecks in months; they’d be lucky, in fact, if they ended up paying themselves $30,000 apiece for the year. Nick was making ends meet by Air­bnb-ing out his apartment a couple of blocks from their office and commuting an hour each way from his girlfriend’s place in Petaluma. Chris was leaning hard on his indefatigable wife. For this they had upended pleasant lives, and they could no longer quite remember why.| Nick, 32, has sandy hair prone to straw-pile disarray; he speaks in quick, tremulous bursts, and holds himself with a schoolboy’s fretful defiance. He and his girlfriend have a lithe golden retriever, Emmy, and Nick often seems less like Emmy’s owner than he does her bewildered, affectionate older brother. Chris, also 32, is a calmer presence, with sunken eyes, a shaved head, and a slow, soft, pressurized voice. His mien is both monkish and military, as if he ought to be wrapped in a dark tailored cloak.| Anxiety, as it had mounted steadily through the fall and into December, drove the two friends along opposite trajectories. Nick had become jumpier, more spastic, with the light threat that he might roll his eyes back into his head and faint; while the more out of control their circumstances seemed, the deeper and slower and more effortfully controlled were Chris’ voice and bearing. High-stakes entrepreneurship is an exercise in restraint, and Nick and Chris gave the impression of suppressing different things. Nick seemed as though he might at any moment unravel into fear; Chris, into anger. When Nick began to mutter imprecation—“fuck fuck fuck fuck fuck,” it went, almost Tourettically—Chris folded him into a stern bear hug. Nick is a fidgeter, constantly moving his cursor with his arrow keys and tapping his foot underneath his desk. Chris believes that what saved their relationship was moving to a carpeted office.| Silicon Valley is not a place where one is invited to show frailty or despondence. It is, as Nick puts it, “the place where everybody is killing it all the time.” This might seem peculiar, given that the lot of the small-business founder has always been a fragile one. But in recent years the Valley has successfully elaborated the fantasy that entrepreneurship—and, more broadly, creativity—can be systematized. This is the basic promise of accelerators (Y Combinator et al.), that success in the startup game can be not only taught but rationalized, made predictable. Starting a company was once an urge felt only by the blindly ambitious and slightly unsound, but in the Valley it’s been ostensibly transformed into a scheduled path one can simply elect and apply for, rather as one might choose law school or Wall Street. And the promise of professionalized entrepreneurship has had a particular allure in recent years, since finance has been tarnished and a career in law made increasingly uncertain. Starting a company has become the way for ambitious young people to do something that seems simultaneously careerist and heroic.| This daydream of constant killing-it has made it difficult to talk about how fearful and distraught the life of the founder can be. But over drinks with close friends—on that rare occasion when an early-stage entrepreneur has time to have a drink or see a friend—almost any founder will tell a story that much more closely resembles Nick and Chris’ than it does the story of your favorite billionaire, reverse-engineered to seem a neat matter of destiny. This is especially true today, in the era of what observers have come to call the “Series A crunch.” Due in part to the rise of startup accelerators like Y Combinator, as well as to the surplus capital washing around the Valley from recent IPOs, it has never been easier to raise a small amount of money. And it has never been easier to build a company—especially a web or mobile product—from that small amount of money, thanks in part to the proliferation of cheap, easy development tools and such cloud platforms as Amazon Web Services. But the amount of “real” VC funding (i.e., Series A rounds) to be allocated hasn’t kept pace. The institutions that write the big checks, those that might support and sustain real growth, can survey what a hundred companies have managed to do with a small check and put their real money on the propositions that promise the greatest yield and bear the least risk.| Nick and Chris no longer cared about “killing it.” They were too honest and too tired for that language and that posturing. At this point they just wanted to survive. They had about a month to raise $1 million or they would no longer be able to make payroll.| “It’s a story out of Dreiser,” said the intellectual historian Fred Turner, referencing the late-19th-century novelist who bleakly chronicled the exploitative early days of American industrial capitalism. The Dreiserian was a particularly strange mood to reconcile that day, given that it was winter and, on the way into Turner’s office on the Stanford quad, I’d picked one kumquat from a heavy bunch on a laden tree. “In Dreiser’s day it was the same,” he went on. “New York didn’t care about Chicago, but Chicago was where the hogs were being slaughtered. Now New York doesn’t care about San Francisco, but today the hogs are being slaughtered in San Francisco.” What Turner meant is that these are the charnel grounds of the new economy, and that there isn’t anything all that new about the new economy. Turner’s work, most notably his book From Counterculture to Cyberculture, has described the contemporary ethos of the Valley as a synthesis of Cold War defense research and the ’60s spirit of New Communalism, creating—in theory—a nonhierarchical, networked approach to business. But in practice, business in the Valley continued to run in a familiarly exploitative way. The Valley might not actually make much in the way of tangible goods, but like industrial centers before it, it’s the place where the astounding success of the very few has been held out to the youth in exchange for their time, their energy, and—well, their youth.| For that mild month of January 2014 I’d been renting a pallet at one of San Francisco’s many “hacker houses,” so that I might meet some of those hopeful youths and see how they felt about their odds. On Airbnb and craigslist and Facebook there are at least half a dozen of these shared living spaces, advertising themselves as frictionless on-ramps to Valley glory. “We’ve got guys from every great startup here,” the guy who ran the place said on the phone. “Square, Lyft, Uber, Dropbox, Twitter, Apple.” Securing a bed there required no fewer than three interviews over Google+ Hangout—one of them a “technical” assessment—yet somehow he couldn’t find a way to email a photograph of the available room. I arrived to find I was paying $1,250 for a mattress on the floor, behind a panel of imbricated torn shower curtains, in an unheated rabbit warren of 20 bunk beds under a low converted-­warehouse ceiling. Unmarked from the outside, it was located on a deserted block in the vaguely disreputable neighborhood west of SoMa and south of the Civic Center, separated from the Mission by little tent cities under the highway. To get inside, you had to pass through a bolted air lock piled with trash.| My cohort hailed from all over: Mumbai, Sydney, Hamburg, Appalachia. They’d been in San Francisco two days or two weeks; the longest-standing resident had been there about four months. At least at first, people referred to each other by vocation. There was the iOS developer from Houston: a shy, gangly, endearing kid just a few months out of an Ivy; he’d stayed for his degree, which he worried might seem démodé, but he was only teased a little by the higher-status dropouts. There was the bitcoin guy, wide-eyed with a bowl cut, who’d never before left his Appalachia backwater. And the Australian engineer who was starting an engineering employment marketplace when he wasn’t engaged in Tinder encounters.| Then there was the doctor, who slept on the other side of the curtain from me. A heavyset guy of 23, he’d woken up in Mumbai one morning and could not bring himself to clock in at the large municipal hospital where he worked. He’d always been a coder but had obeyed his parents and gone to medical school. By 9 am India time he’d completed the flophouse’s technical interview via Google+ Hangout and bought a ticket leaving for SFO that night. His parents said, “Why today? Why not tomorrow? Or next week?” But he knew if he waited even a day he’d never go. On his second day ever in America he had an informational interview at Google. He seemed disoriented but in good spirits. He slept without a blanket and with three different devices charging beside him on his bed, lined up like kittens sleeping at the teat. His girlfriend always seemed available for videochat sex. He was really considerate about the whole thing. He usually waited until he thought I was sleeping, and even then he used headphones. All I could really hear on his end was his muffled instructions, along with profuse apologies that he couldn’t be any louder. It occurred to me that his girlfriend was quite a good sport, since in India it was midmorning. I could tell he really missed her.| All these kids, who didn’t yet know what it was like to have a company of their own, or wind down a company of their own, or work for a giant company and ride the bus, seemed certain of one thing: that the longing for total revolution that had for so long been the hallmark of youth was, at last, about to be fulfilled. The only thing they could count on was that they were going to be the generation that partook of the process by which all would be rendered irrevocably different. It didn’t seem to matter what the difference was, or whom it helped or hurt. It just mattered that things in the future would be unlike anything we’d seen before. And that, in the process, they were sure, many of them would get very rich.| On January_3, Nick and Chris met with two investors, Bobby and Ullas, part of a group of superangels centered—somewhat improbably—around a rug store in Palo Alto. How rug merchants got into tech investing is a long and complicated story, but the short version is that people who buy expensive hand-sold Persian rugs over mint tea in Palo_Alto happen to be profitable people to know. The group had been involved in a lot of impressive early-stage deals, among them Uber and Dropbox.| Nick and Chris had drawn up revenue projections, compared those to a burn rate based on the engineers they knew they had to hire, and concluded that they needed a runway of about $1 million to get them to strong revenue growth by Q3. Bobby and Ullas thought that they could reach out to their network and assure a commitment in the $700,000 to $900,000 range. They wanted to see at least $200,000 in commitments from other investors to close out the round. While they didn’t have to make this explicit to Nick and Chris, it’s standard practice for early commitments like this to be contingent on filling out the rest. All Valley offers are provisional until the money is actually in the bank, and if Boomtrain couldn’t find another big investor, the rug guys might very well back out. Also, Nick and Chris clearly hoped to have a big, recognizable VC firm in this round—both for the credibility, which would go far toward their ultimate success, and for the head start it would give them when they needed to try to raise an A round, perhaps in a year’s time. Still, even this soft commitment from Bobby and Ullas was great for morale. What they needed, perhaps even more than money, was a sense of momentum.| They also had a promising lead on the hiring front. It’s extremely difficult to hire talented engineers in the Valley unless you’ve got incredible PR, can pay a fortune, or are offering the chance to work on an unusually difficult problem. Nobody was buzzing about them, and they had no money, but the upside of having a business that relied on serious machine learning was that they had worthy challenges on the table. On January 4, they made an offer to exactly the sort of engineer they needed, Tevye. He had a PhD in AI from MIT. Just to contextualize what that means in Silicon Valley, an MIT AI PhD can generally walk alone into an investor meeting wearing a coconut-shell bra, perform a series of improvised birdcalls, and walk out with $1 million. Nick and Chris had gone to good schools of modest profile—Nick to the University of Puget Sound, Chris to the University of Vermont—and while Nick also had a Harvard business degree, both were skeptical about the credential fetish of the Valley. They were happy to play the game when they could, though. They invited Tevye, along with a few technical advisers, to their shared office space for a Saturday “immersive,” or strategy meeting. Nick and Chris fetched paleo plates for the tech advisers, and everyone gathered around a giant butcher block in front of a whiteboard.| Chris convened their meeting by saying, “We have 10 companies waiting to work with us, and we’re about to close a round of funding.” These statements weren’t strictly true, but one couldn’t hire engineers without projecting a sunlit-uplands future. As Chris had put it to me, “Lying your way along puts you in a bad place. But you do have to balance transparency with optimism.” And Tevye would be a real boon for the company, exactly what they needed to close their deals. The only reason he was considering joining Nick and Chris was that he’d once thought of founding a similar sort of venture. He’d be taking a 40 percent pay cut to join them, but he would have his hard problem and would get to run his own data-science team. Nick and Chris had allotted an equity pool that was larger than average, and they were making Tevye a generous offer—in a highly theoretical sense. San Francisco was full of people walking around with their pockets stuffed with 1.2 percent of nothing.| Tevye signed up. He asked to begin on January 27, roughly two weeks before Nick and Chris’ money was set to run out.| Now that they had an engineer, Nick felt pretty good going into his meeting on Sunday, January 5, with what would, with any luck, be their first paying customer. He met the general manager of a small property that was part of a giant media concern. The GM knew how the game was played: He was happy to be a “customer” in exchange for a deep discount. He looked over Nick’s fee schedule and selected the service he thought his company would need, then negotiated a 75 percent discount for a three-month trial. It wasn’t much in the way of revenue for Boomtrain but it was something, and if it was successful they could expect the parent company to be a great channel partner, maybe—who knew?—bringing them into their other properties across the board.| On Monday morning, Nick and Chris took stock. They had one customer, a big name who was paying them almost nothing. They had one new engineer, sterling of credential and reputation, but in 25 days they might have no money to pay him. They had a syndicate of investors, who had soft-committed on the basis of revenue projections they feared they might have to downwardly revise and who might back out if they failed to secure a meaningfully large check from an unconnected, well-known, preferably institutional party.| Chris pointed at Nick as though he weren’t there. “He’s 75 percent sure we’ll pull this off.”| “I’m 99 percent sure we’ll pull this off,” Nick said. “But then again, I’m the delusional one.”| Chris, for all his outward placidity, was the pessimist. “That’s why we work so well together.”| It was hard to imagine that Nick and Chris, coarsened and scarred by the gauntlet they’d endured, had ever partaken in the hacker-house dream of total disruption. But in fact Boomtrain had begun with a very different, and similarly transfor­mational, vision for what it might do. They had friends who were making videos, young filmmakers shooting web shorts on a shoestring. Meanwhile, lots of people were looking for things to watch online. But the online video marketplace was fragmented and liable to the power of moneyed interests. There was stuff on Hulu and stuff on Netflix and stuff on YouTube and—most important, to them—stuff being made here and there by aspiring amateurs. What the Internet needed, Nick and Chris reflected, was a clearinghouse to help make sense of it all. It would be good for the makers and good for the consumers.| Nick and Chris met 10 years ago in Seattle, just after college, where Nick founded a magazine of international politics and Chris, who had graduated with an engineering degree, was working at a digital ad agency. On one of their first outings together they took to the water. Nick grew up sailing and had just bought a junky little boat for a few hundred dollars, around which Chris raced—in a boat he’d dipped into his savings to buy—in mocking circles. From those very first days they talked about founding something together. At first, this was a form of courtship. One would say, “I’d really like to start a business with you one day,” but for a while it was just a way to communicate warmth and trust. Over time they grew close; Nick’s sister became inseparable from Chris’ wife, Chris got along famously with Nick’s college friends, and so on. It was as though they starred in a sitcom that lacked a budget to pay extras.| Nick went away to business school at Harvard; afterward, he turned down offers from Google and Wall Street and went to work for a medium-size technology company. Chris, meanwhile, worked his way up to running the interactive division of the digital agency. Both were comfortable but longed to run their own shop, and to do so together. On a sailing trip in the Sea of Cortes for Nick’s 30th birthday, they filled a yellow legal pad with ideas.| They settled on that grand vision for Internet video, a social-discovery engine where all the fragmented content could be aggregated and then recommended based on algorithmic processing and social data. If it worked the way they wanted it to, they could help small-budget producers circumvent the existing system’s gatekeepers. On the strength of an unsteady, ill-lit two-minute video they shot on a webcam, they were accepted into AngelPad, a local incubator run by an early Google employee. Within eight weeks of their graduation, they’d collected $450,000 on a convertible note. Chris showed me a picture of Nick’s hand, purple and swollen like a bony eggplant from the high five they’d given each other when they got their first commit.| A few months out of AngelPad, however, they “pivoted.” They’d learned, in part from investors they’d met and in part from just trying, that marketing a site to consumers is just too hard, at least if you don’t have a fortune to begin with. Selling to business customers—a structured, repeatable process—would be a lot easier. You need 10 customers, 100 customers, rather than 1 million or 10 million users. And your investors can introduce you to potential customers, because they are already investing in many of them as well.| So before Nick and Chris really had the chance to realize it, they’d “ripped out the heart” of their original idea and put it to work in the service of a new idea: a “multichannel personalized notification platform.” It was a software-as-a-service product that allowed corporations to tailor individualized recommendations to their millions of customers. It could be thought of as a Netflix-style recommendation engine that any business could plug into without building its own. There were already a slate of companies that did this for on-site recommendations, the little boxes that suggest what videoclip, magazine article, or pair of pants you might want to see or consume next. Boomtrain’s value proposition was in using the same backend to drive personalized notifications across all platforms: they could offer onsite boxes, personalized emails, SMS reminders, or push messaging.| They decided to focus first on emails, mostly because big media companies already had seven-figure line items in their budgets for the undifferentiated mass emails they were sending—for a click rate of maybe 3 percent on a good day. Their long-range plan, however (what investors in the Valley like to call the “Google-sized” version of the company), involved creating a master identity system that would recognize customers across multiple sites. It would be as if Netflix recommended movies based in part on what you’d read in The New York Times and bought at Zappos, and it would work out of the box for any site. Like any company that collected data, it would grow exponentially more powerful and appealing as it achieved scale. The more customers they had, the better their recommendations to all customers would be.| Nick and Chris would never explicitly admit it, but in unguarded moments it seemed clear that they missed their old idea, the one they’d come up with on the boat, the one that had served a broad and stately social purpose. Their moments of greatest animation were when they showed off their first demos and decks, when they seemed decades younger.| At the same time, however, one of their greatest regrets was that they hadn’t pivoted early enough, because now they had so little time. In the Valley you can raise money on promise—as they’d done once—or on results, which they didn’t have quite yet. They were left to brood over a list of if-onlys. If only they’d pivoted two months earlier! If only they’d stayed at their jobs slightly longer. If only that one VC, a partner at a large brand-name East Coast investor, hadn’t suddenly left his firm just before they were to close on $500,000, a half million that would have led, effortlessly, to twice that amount.| At this point, they were forced to play a shell game with everyone they met. Without investors, they couldn’t afford to hire the engineers they required to sell a robust product to paying customers. Without customers, they had no market-traction data to show investors. They needed investors to get customers and engineers; they needed customers to get investors and engineers; they needed engineers to get customers and investors. If they didn’t act as though it were all in place, there was no chance it would ever fall into place. By mid-February, they thought, either all their stories would come true or none of them would.| “Techies” often get lumped together, but the lifestyle gap between startup founders and the employees of large companies is unbridgeable. One night I escaped the hacker house to go out with a group of founders from various startups: a dating app, two food-related apps, a videochat app, something that had to do with drone deployment, and an app that was, at last, going to help all of us communicate better. At 10:30 the waitress came over to take our orders for a second round. I ordered another whiskey, but everybody else looked at their phones with muted anxiety. At 11 pm the founders rose in pairs to leave, as if they had an exam in the morning. One founder (his company was literally an app that optimized app stores for other apps), who’d ordered a water and had taken off neither his backpack nor his jacket, apologized on behalf of everybody for leaving so early.| By contrast, on a weekend afternoon I went over to find my young cousin—a talented and good-humored UX designer for Google—with his friends in Alamo Square, where they were winding down a barbecue in the January sun. I arrived late, as the fog was beginning to gather in the west over the Richmond, and the group assembled there was playing a game of mass footsie on some blankets they’d set out on the leeward slope. My cousin was perpetrating amateur reflexology on the feet of a giggling companion while she idly juggled the decapitated head of a pirate piñata. The candies that had spilled from the piñata were scattered about in the grass, glinting.| A few of them worked for Google in one capacity or another, though nobody wore the company’s logo. I asked if anybody there worked for a startup. My cousin looked around and shook his head. “Some of these people used to,” he said, and went back to planning the hourly activities of a party they’d be throwing when it got nicer out—though it didn’t seem possible that it could get nicer out, ever, than it was right then—where they’d begin one evening with dinner and conclude the following morning with brunch. They’d gotten as far as dawn yoga. It began to get cold and everybody rolled up the blankets and went back to the house, which had several terraced floors of downtown views, where the gold late light flashed off the aquarium glass of new high-rises downtown.| The entrepreneurs, if they were old enough, could perhaps remember a time in their life devoted to such extracurriculars as spare time, drinking, or mass post-piñata footsie. My cousin was having the time of his life, but a lot of the startup guys—perhaps, in part, as a defense—saw riding the corporate bus as the most dismal of failures. Even Nick and Chris, who did not know contempt as a mode, were appalled at the thought. This was a somewhat self-delusional attitude, as their second- through sixth-best-case scenarios were being acquired by one of the five giant, powerful, wealthy companies. Even if Nick and Chris survived another year, there was a good chance they’d just be surviving to put themselves in a position to get a nice signing bonus when they finally conceded to days framed by long bus commutes—just like the many other entrepreneurs who came to look at having a failed startup as an alternative to graduate school.| The best-case scenario, of course, was an IPO; it was the only way to preserve the promised autonomy of a startup, even if it meant being beholden to shareholders. The dream was for your company to be the one in a thousand that became Uber, Dropbox, Airbnb, Square. They’re consumer-facing, first of all, and thus part of a celebrity matrix, and they make or enable something that people pay for. They aren’t just advertising companies, like Facebook and Google. The guy at the flophouse with the most clout was a mop-headed coder who worked at Square. One night at dinner he slyly mocked another former flop-houser, this one a newly minted UX designer at Apple. At Apple you sometimes couldn’t even work on your own bus, lest employees in different groups see what you were up to; at Square, everybody was emailed minutes of everybody else’s meetings. The biggest status play at that dinner table, and at hundreds like it, was to work at the biggest company that maintained startup cred, the biggest place you could feel as though you were working on an imaginable whole rather than a tiny part.| One day I was out with Chris picking up burritos when a car slowed and the driver waved.| “So this is your new car, eh?” Chris asked. It was his old and close friend Tony, whose company had just been bought by Dropbox. I asked Chris how he thought Tony felt, going from the anxiety of being a founder to the easy life of a 9-to-7 engineer at Dropbox.| “You’d have to ask him,” Chris said. “But I bet it feels like a big fucking relief.”| Boomtrain’s days at the office were a blur of sales calls, engineering meetings over Google+ Hangout, and pitches to investors. It seemed like an inhuman feat that Nick could keep himself awake for the sales calls, where he delivered the same pitch over and over to the same bored, nontechnical marketing people. Chris seemed to derive a lot of energy from the engineering discussions; perhaps this wasn’t quite the company they’d intended to found, but Chris is an engineering autodidact, and he drew great pleasure from the technical details of network architecture and data structure.| Nick and Chris tended to take investor calls together when they could. Nick leaned over the computer while Chris lay back in his seat. “I don’t know how fast you move,” Nick often began his pitch, “but we’re moving fast over here. We set out to raise $1 million, but we’re already at $900,000 committed. Now we’re considering letting the round get oversubscribed, so we could try to find some room for you.”| “Don’t worry,” the partner always said. “We can move fast.”| Nick had good answers to questions about what differentiated them from their competitors and convincing estimates of the market size in the personalized-notification space. Sometimes he had to scramble to look up the website of a competitor he’d never heard of, but he could usually bring that off. All invariably went swimmingly until they had to answer two questions.| The first: so, who’s leading the round? “I’m sure you’ve heard of the Persian rug mafia,” Nick would say.| “Ummmmm … no.”| “Well, they’re great investors. They were early at Uber and Dropbox.” The invocation of Uber and Dropbox perked up any conversation in the Valley, but it rarely seemed all that reassuring to investors.| The second question, always, was this: What kind of data did they have? By what metrics could they prove the value proposition of their product?| Nick and Chris had answers only about their internal tests on clickthrough rates for their first product, the one they’d abandoned. Under questioning, they eventually had to concede they’d just finished building out the new post-pivot technology and didn’t yet have meaningful numbers to show. This was the point when the accrued investor energy began to dissipate. At times like these Nick tended to jellify, as if all of his bones had suddenly fled his trembling body, and he would look to the steely, relaxed Chris for support.| “I have to admit, I just wonder,” one investor said. “How special is the special sauce?”| “I love the product,” another said, “but I just don’t know your customers that well.”| “It’s a great team, but I worry that you guys are selling to content publishers, and I could only connect you to ecommerce customers.” “Wonderful technology, but you guys are working in ecommerce, and my whole network is content publishing.”| “You might find a hundred customers, but I don’t know if you’ll find a thousand. I can see you guys getting to $10 million in revenue, but it’s hard to see how you’d get to $100 million.”| “Why now? When I was at Yahoo in 1996, we were working on the personalization problem then.” (“Yeah,” said Chris later, “and you didn’t solve it.”)| And one of the biggest lies in town: “I love what you’re doing, but as an investor I just don’t know what my value add would be.”| At the end of these meetings, the investor would always say he had to talk to his partners and would get back to them.| “I give that one,” Nick said once, “about a 9.467 percent chance of working out.” “We just tell him,” Chris said, “that we’re focusing on product and customers for now. We’re onboarding four customers next week.” Even if they were just pilots, that was actually true, and it meant that within six weeks they’d have real answers to the metrics question.| “But we told him a week ago that we didn’t have any real customers yet,” Nick countered, “because we’ve had to spend so much time fund-raising.” Nick got an email from one of their earliest investors. He was writing to them to suggest that now was the time for them to get press, to push their seed round along into completion. He suggested they spin a story about their pivot to TechCrunch. “What’s the story going to be?” Nick asked.| “We had an unsuccessful business,” Chris said, “and now we have a marginally more successful business, which might be really successful if anybody trusts us enough to give us the money so we can actually stop fund-raising and focus on our product?”| “We pivoted from a business nobody’s ever heard of,” Nick went on, “to another business nobody’s ever heard of, and we have big investors we can’t name and customers we can’t mention, but trust us, we’re a big deal?”| This was gallows humor, but it meant something. It wasn’t a lie, exactly, to get your business three or six or nine months down the road by talking about your business as if it already were six or nine months down the road. The sorts of customers they were selling to, Chris explained, were big “legacy” companies that tend to move slowly and by committee, so Boomtrain could afford to make promises on delay. Push notifications, for example: That was something they couldn’t do quite yet, though they acted as though it was part of their standard package. But they could easily prioritize it and get it done in three weeks. If a paying customer wanted it right away, they could drop everything and get it done in a week. This was the accepted way. But trying to place a phony story of their impending greatness on TechCrunch felt a little sleazy to them. They had too much heart for that.| At the end of one of their investor meetings, a partner said, “If I write a check and you close this round tomorrow, and the next day you get an acquisition offer for $100 million, what do you do?” Chris later explained that this was a trick question. Everyone knows the right answer is “Hell no, I wouldn’t sell. This is a billion-dollar company!” This is the answer any flop-houser would give.| “But that’s such bullshit,” Chris said. “Of course we’d sell. We’d provide really well for our engineers, we’d get out of this impossible-seeming situation and start over with a clean slate. But you’re not allowed to say that.”| I asked what he’d do with his share of that $100 million. He didn’t hesitate.| “I’d buy a boat, and Michelle and I would take off, spend four years sailing around the world.” During the course of his career he’d canceled two vacations with Michelle, one to Turkey and one to Paris, and now that he was a founder he didn’t even bother scheduling one. Michelle had been amazing all the while; it was clear to Chris that she’d discovered vast reserves of strength she’d never known she had. “But, still, I’d just like to take her away for a while.”| By this point the contrast between the painful reality of Boomtrain and the vacuous optimism of my young roommates was becoming harder to bear. The iOS developer got a job at a company called Scanadu. I asked what it did. “Basically it’s this thing that’s going to disintermediate doctors. It checks your vitals for you, like that thing on Star Trek, and it’s going to totally disrupt the medical industry. It’s going to make doctors obsolete.”| These young men were only happy when they were talking or thinking about being in the business of wholesale transformation. On the day the iOS developer got his job making doctors obsolete, a Ruby developer who had recently moved out came back to the house to cook dinner.| He was six months out of a technical institute in the Northeast and had just gotten his first job ever. The company did payroll.| “These guys raised $6.1 million in seed funding out of Y Combinator. That’s probably the biggest seed round in Valley history. We’ve got a ton of momentum, solving real problems. It’s pretty awesome.”| “What problem are you solving?”| “Payroll.”| “What about payroll?”| “The problem of payroll. You should hear the emails we’re getting from our customers.”| The Ruby developer couldn’t name a problem with payroll that his company was solving; he thought they were just solving a problem called payroll. He was only on payroll for the first time in his life, and needless to say had never himself run into payroll problems. But he was working for a startup with YC credentials that had leveraged new technologies and raised a lot of money, so he could reasonably feel now that he hadn’t just joined a company that did something incremental—fixed the various problems with payroll, of which there are many—but something revolutionary, i.e., fixing the problem of payroll.| The Ruby developer was advising the iOS developer, now that they both had jobs paying $120,000 a year, about moving out. The Ruby developer had liked the camaraderie of the place but had wanted to live somewhere he could bring girls (“in that unicorn of an event”) or put up guests. The iOS guy didn’t want to pay more than $2,000 a month for a studio and was having a hard time finding something.| “You can’t forget,” said the Ruby developer, “that this city has produced more millionaires than any city in the history of the world.” He was doling out glutinous scarlet clumps of Trader Joe’s tortellini beside heavy jaundiced globs of Annie’s shells and cheese. He’d been around long enough to make over a hundred grand a year, but not long enough to know that carbs were bad signaling.| “What parts of the city are you looking in?”| “Oh, you know, the actual city.” I asked what that was. “SoMa, China Basin, Mission Bay. What people like us call the city.”| He’d been in the city for something like three weeks, and most of what he knew about it came from people who themselves had only been around for eight to 10 weeks. Mission Bay was a landfill turned into a hospital that hadn’t even been finished yet. China Basin felt like some prefabricated drag-and-drop plot of blocks out of the original Sim­City. And yet there still was, however dimly felt, the newcomer’s desire to feel a part of something that had been around awhile. The guys wanted to go to a hookah bar on Haight, so we got a Lyft and got dropped off in front of where the Red Vic used to be. “This really feels like the ’60s,” one of them said, and I couldn’t tell if he was joking.| At last there was some very good news for Boomtrain. Nick and Chris had gotten a meeting at Google Ventures, the company’s quasi-autonomous investment arm. Traffic on the southbound 101 had no momentum, and they were so preoccupied they didn’t seem to notice the spreading flares of copper sunrise over the Oakland Hills across the bay. Nick had woken up at 4:30 in the morning to get down to the city from Petaluma so they could make the drive together. “We’re going to have to put our best foot forward,” Chris said. “That’s you,” Nick said. “You are our best foot.” He was giggly from so little sleep and such high stakes.| At Google Ventures, the receptionist let us into a cafeteria with an Odwalla refrigerator and some basketed fruit. The fruit was labeled. The tangerine placard advised that the tangerines were from the Rising C Ranch in the San Joaquin Valley. It went on to note that there was exactly one tangerine in a serving of tangerines. There were no tangerines left.| The partner didn’t want me in the meeting, so I told Nick and Chris I was going to drink my body weight in Odwalla.| “Please do,” Nick said. “It’s the only thing we’re going to get from these guys.”| Nick and Chris went into the meeting and I sat across from the Odwalla trove. On a large screen flashed the wisdom of founders. Ask forgiveness, not permission. Only traction matters. Have a great team. Lead from the front. If you think your product is perfect at launch, you waited way too long to launch it. The receptionist was numb to the bromides. She bounced almost imperceptibly to light house music. I looked up the GV partner on Facebook, the one who hadn’t let me into the meeting. He and I had a few friends in common, so I emailed one of them to do some side-channel due diligence of my own. She wrote back right away to say that he had just posted pictures on Facebook from a Miley Cyrus party he was at in Vegas.| I felt like I was going to float away on a little antioxidant cloud of Odwalla but went to get some more anyway, and by the time I got back Nick and Chris were outside. They seemed loopy. Chris had jumped onto a rickety free Google bike painted in Day-Glo colors, like something that might have been strapped to a Merry Prankster bus, and he was riding in unsteady little circles in the shade of the empty lot. The bike was too small for his large frame and crunched his knees.| In the car Chris pounded on the dash. Google Ventures was in! Google Ventures was in! They’d soft-committed to at least $100,000, maybe even $200,000. The partner had really gotten it. He’d totally agreed with their upmarket strategy, unlike the investors who wanted them to focus on a no-cost-to-deploy self-serve product. All he wanted was a revised operational plan and a clear path to a Series A—a path that was a lot clearer when you had Google Ventures on your cap table. The final thing he wanted was for Nick to send their deck over to a guy he trusted on their market space, at a boutique firm in LA. I felt bad I’d written off the Google Ventures partner for his closed-meeting, Miley Cyrus–consorting ways.| Just as we got back to the city, a report came over the wire that Nest had been acquired by Google for $3.2 billion in cash. Nest had been backed by Google Ventures, their biggest win so far. This seemed like an auspicious bit of news. Nick checked his email and got the signed offer letter from Tevye, the MIT AI PhD. And the paying customer, the one from the large media conglomerate, was integrated and about to go live. It all seemed as though, in the span of one hour, it was coming together at last.| Boomtrain’s meeting with Bobby and Ullas had been set for the third week in January, by which point they were supposed to have almost filled out their financing round. In the three weeks leading up to the meeting, the interest from Google Ventures had been their only great stroke of good fortune; despite having talked to at least two dozen investors, they were essentially in the same place as when they’d left Bobby and Ullas at the beginning of the month. If the Google Ventures commit came through, they would be fine, but they had to be careful not to oversell the possibility. It would be terrible if GV seemed to have been definitively in the round but backed out after due diligence. That was the kind of thing that really spooked investors, when a bigger investor backed out at the last minute. The potential coinvestor in LA—the one whose opinion the GV partner in Mountain View was counting on for his own decision—sent an email asking if he could fly up for a full partner meeting at the end of the week, which was a good sign, but it was two days after their meeting in Mountain View and their temporary elation had given way to the old anxiety.| There was no way to know how Bobby and Ullas would react to this state of affairs. If they didn’t agree to wire the money they’d committed, despite the fact that the round seemed very unlikely to close by the end of the month, Boomtrain would not make payroll, Tevye would likely disappear, and they’d have to tell their beloved engineers (whom they’d largely been protecting from their anxiety over the company’s uncertain future) that they’d be winding the venture down.| On the morning of the meeting, Nick arrived to find the front door of their coworking space smashed. Earlier arrivals had just crunched their way over the drifts of glass, so it was left to Nick to take up a broom and sweep the shards into a glittering pile.| Bobby came a little early, a good sign. He was a large man, his shoulders a rounded bulk rising over his neck, and on him was the scent of lather. He very carefully turned his jacket inside out and folded it behind him. He rolled up his sleeves. Most investors ignored me at meetings, but Bobby addressed me right away. “You’re going to hear some very tough conversations of valuation.” He gave the impression of groomed power. Nick leaned forward, his elbows on his knees. Chris leaned back, his arms loose by his side.| Ullas would join them later, but Bobby didn’t have a lot of time and there was a lot to cover: valuation, timeline, closing date, board seats. Bobby wanted Ullas to take a board seat, because Ullas was the kind of guy who didn’t start shaking when things went wrong. Bobby liked to stay off boards. He preferred an advisory role, so he could stay on the entrepreneur’s side.| “So do you think it’s still reasonable to shoot for the end of the month?” Chris asked, with affected nonchalance.| Nick’s dog, Emmy, careered around a corner and bounded toward the center of the meeting. I caught her and held her back so she wouldn’t leap onto Bobby’s expensive clothing. I could feel her heart beating madly under her ribs.| Two days after their MEETING WITH GOOGLE VENTURES, ELATION HAD GIVEN WAY TO ANXIETY.| Bobby thought the end of the month was fine, beginning of February—either way, it was all fine. Maybe the second or third week of February. It didn’t matter, there was no rush. Bobby and Ullas were both more than happy to wait. First he wanted to see the latest operational plan. Nick opened his mouth as if to say something, then just brought up the plan on his laptop.| “So where on here is your break-even point?”| Emmy looked across at her owner. Nick swallowed. “We’ve revised those aggressive numbers and moved it back into the fall, October or November. It’s a big cushion that allows us to slip a little. Though of course we’re not planning to. Slip, that is.”| Ullas arrived. Whereas Bobby had a heavy, settled, mountainous energy, Ullas was sharp, with a brilliantined thatch of thick hair, almond eyes, and a pointed chin. He wore long shiny tapered shoes.| “We’re both inclined to move forward,” Ullas began. He wanted to finalize the investor list. Nick produced his yellow legal pad. He’d written down investors with numbers by their names, labeling GV and their LA partner as soft commits. Ullas pointed to them.| “Google Ventures,” he said, clearly trying not to seem impressed. “I didn’t realize they could write small checks.”| “We’re kicking the tires pretty hard with those guys,” Nick said. “We just want to make sure there’s room left in the round for them.”| Next to Bobby’s and Ullas’ names Nick had written ranges, since they had never been very exact about what they were offering. Ullas gestured that Nick should just go ahead and add up the list of numbers, but Nick hesitated; he wasn’t sure which numbers to use. After a moment Ullas drew his slender fingers down the column of lower numbers. The total now came to about $750,000.| If they were still talking about a $1 million round, the presumed contribution from GV would close it out. But they had to talk about hiring. Nick and Chris had planned to hire three more engineers right away, but Bobby and Ullas thought they needed a dedicated sales guy and a few people in biz dev. Plus, with their revised revenue projections, Bobby thought they could use a few more months of runway. So now Bobby and Ullas thought Boomtrain needed to raise something closer to $1.5 million.| Nick and Chris had started this meeting thinking they had $900,000 of a round of about $1 million. Now they were learning they had only half of a much bigger round. “So where’s your other $750,000 going to come from?” Ullas said. “Step up and get it. It’s good exercise for you to get out there and sell the company.”| Worse, the question of the closing date had not been settled, and it seemed as though the meeting was in danger of ending before it could be brought up. Nick hadn’t managed to find a good time to mention that without a more or less immediate infusion of cash, they wouldn’t even have the opportunity to find the money they’d need to close the round. Boomtrain hung in the balance.| Just then Tevye came in. Chris waved him over and introduced their new MIT AI PhD. He was perfectly badly dressed. They welcomed him to the team, and he left. Tevye’s cameo, brief as it was, seemed to change the tenor of the meeting. “How much cash do you have in the bank?” Bobby asked. Nick stuttered. “You can make payroll this month, yes?”| “This month, easily. Next month, maybe not …”| “To the wire, this is,” Ullas said.| There was a long, heavy pause. “But don’t worry, this happens all the time. We’ll do a staged close. You’ll make payroll. Then you go out and find the rest of the money you need.”| Bobby rolled down his sleeves, carefully unfolded his jacket, and turned it right-side-out. Nick and Chris thanked them for coming. And, with that, they were still in business—a variety of it, at least.| In the Silicon Valley “ecosystem”—a troubling, pervasive word, often used in bad faith, that makes the problems of a place like Boomtrain seem organic, natural, cyclical—the job of Paul Martino is that of roving for-profit life support. Martino’s firm, Bullpen Capital, usually works with companies that are a little further along than Boomtrain; most of his clients have raised a million bucks or so and are stuck at a slightly higher elevation in the swamp that held Boomtrain fast—too late for promise, too early for results. He helps bridge those companies on their way to raising an A, but the basic problem his portfolio companies face is the same one everybody faces. It’s pretty easy to get enough money to get in over your head and pretty hard to get enough money to stay afloat. The fact is that the rising tide does more drowning than it does lifting.| Martino and I had made plans to meet at a coffee shop on the main drag in Mountain View, but when he got there he found it too full of nerds on laptops, so he called an audible in favor of the bar across the street, where he could watch the game. He was killing a few hours before his red-eye back to Philadelphia, where he grew up and lives about half the time. He was wearing a gold chain, a light gray windbreaker with a Garden City Casino logo, khaki shorts, and sockless loafers. He cut an appealing figure in the Valley, a no-nonsense stoop-sitting type.| “Look,” he said. “The problem in 1999 was that to get $5 million you didn’t need very much.” He talked as though he were chewing on mouthfuls of nuts. “You needed one or two Stanford résumés, an idea for a prototype, and a live body to give the money to.” It’s hard to get that $5 million now in part because it’s so easy, as it was for Nick and Chris, to get $500,000, especially if you’re coming out of an accelerator. One way to look at it is that the $5 million that went to one company of 10 people in 1999 is now going to 10 companies of two people. “You’ve lowered the bar 10X.”| Which means you’re getting a lot of people starting companies who shouldn’t be starting companies. Another investor I talked to called this “buying a cheap call option on a guy who doesn’t know that’s what you’re doing”—on a guy, that is, who thinks you’re investing in his success, not betting on the high-risk, high-yield chances of it. You know the odds on any given company’s success are long, but that’s why you make a lot of bets. In the first dotcom boom, the risk was largely carried by the investors, but now the risk has been returned to the youth.| Without mentioning the name of the company, I told him about Boomtrain, about what the past few weeks and months had been like for them. About how quickly they’d aged, how much weight they’d lost, the Airbnb-ing, the heavy mask of confidence, the number of mornings they’d woken up at 5 am grinding their teeth. Martino was sympathetic but unmoved. He didn’t expect them to make it. “They ran an experiment. None of their lives have been ruined.” He knew they’d get good jobs, even if it meant the life of a project manager at Yahoo. “And none of their investors’ lives have been ruined either. When they close up shop, their investors will say, ‘That’s one more off the books. I don’t need to help them anymore. I get my time back.'”| Martino watched the game for a minute, then turned back to me and held my gaze. He could tell I’d come to like and admire and root for the Boomtrain guys. I could understand the risk they thought they were taking. I was glad it looked like they’d finally found the momentum they so badly needed. “Let me tell you what the worst thing would be. The worst thing is that these guys get their funding tomorrow and are stuck doing this for another year. So far, they only lost one.”| Boomtrain had planned a company retreat for the last weekend in January, to mark the one-year anniversary of their acceleration. That week of Christmas, when they had 50 days of cash left, Nick told me that it would all be resolved one way or another by the time they got to Tahoe. “I guess we’ll either be getting really drunk,” he said, “or we’ll be getting really drunk.”| But by the time they arrived at the retreat, nothing had been resolved. Google Ventures’ coinvestor said he was keen to invest but had been instructed by the GV partner in Mountain View to hold off; the GV partner, when they finally heard from him, said he was waiting for a full meeting with his partnership. So, on this Tahoe trip to which they’d been looking forward for so long, neither of them got drunk at all.| We drove past the sun- and salt-faded Stateline casinos to Nick’s family’s cabin, on the Nevada side, near Zephyr Cove. The engineers were coming in later in the day, but now it was quiet. Chris asked if I wanted to go down to the dock and look out at the water. The unseasonably warm and dry December had lingered on into January, and the scant snow had melted into patches. He thought about the other companies that had gone through AngelPad with them, a few of which had recently closed. “What happens to everything they did? Does it just wash away?” He knew that if Boomtrain had just six or nine more months, they could at the very least put themselves in a good position to be acquired by one of their customers, which would allow them to feel as though something—some self-respect, some emblem of the work they’d put in—had been salvaged.| When Chris and I returned to the house, they got the bad news that they’d started to expect: Google Ventures was out. Chris seemed less resigned than he often was, a little angrier and a little more uncomprehending. He wanted to know why they’d given such an enthusiastic commit only to retreat. Apparently, Nick said, the full partner meeting had revealed that they’d already invested in companies in the personalization space. So that left Boomtrain to consider a scenario worse than bankruptcy: to get only $750,000 from Bobby and Ullas, meaning no end to fund-raising, no time to focus on sales or hiring, let alone their product.| As it happens, they would avoid that fate. Although their bank account would dip to less than $800 before the first money hit, Bobby and Ullas would bring along a few more investors, and by the last week in February the total round would be jostling up against that $1.5 million target. And then, all of a sudden, three small but respected institutional funds—one of whom hadn’t bothered to return Nick’s calls in January—would practically beg to get in on the round. With Bobby and Ullas’ permission, they would let the round (still a large seed round, not a Series A) get oversubscribed and close with $2 million. The customer pilots that began in January would look even better than expected, and the big media concern that took the deep discount would begin the process of figuring out how to use them in other ways. By early March, when the money finally closed and the numbers were in, Nick and Chris would feel approximately 12 minutes of elation before the anxieties of fundraising were replaced by the anxieties of delivery, both of products to customers and of shareholder value to their new investors.| All the while, Martino’s ultimate warning—that they might someday regret actually getting the money they wanted—would still hang over these two young men, inherent to a system designed to turn strivers into subcontractors. Instead of what you want to build—the consumer-facing, world-remaking thing—almost invariably you are pushed to build a small piece of technology that somebody with a lot of money wants built cheaply. As the engineer and writer Alex Payne put it, these startups represent “the field offices of a large distributed workforce assembled by venture capitalists and their associate institutions,” doing low-overhead, low-risk R&D for five corporate giants. In such a system, the real disillusionment isn’t the discovery that you’re unlikely to become a billionaire; it’s the realization that your feeling of autonomy is a fantasy, and that the vast majority of you have been set up to fail by design.| In the house at Tahoe, Chris showed me his journal, which he hadn’t had the chance to write in for a while. Here and there the slanted, sensitive black text was broken by a crosshatched line drawing of a mountain, a trail, a fish. There were two elaborate maps of trips he’d planned to take—a backpacking trip through Europe, a motorcycle tour of the Southwest—that he’d had to postpone. The last thing he read to me was a line I’d heard him repeat as a kind of mantra: “It’s not the load, it’s how you carry it.”| After that, Chris built a fire and opened his laptop to work, but then thought they might feel better after a run. He called to Nick and a few minutes later we were out on the trail, the pine needles wilting in the melted snow. Eventually we jogged down to the beach, the empty docks extending into the water like splayed and broken spokes. The sun was almost down, the dilute pink winter light turning a glassy gray on the silent water.| They splashed off into the shallows like little boys in summer. Chris swept up his hands and arched his back and then was under. Nick followed a moment later. They shot back up through the surface at the same time, then waded, proud for once to feel in no particular hurry, back to the shore."}