{"title":"How a Snowdenista Kept the NSA Leaker Hidden in a Moscow Airport",
"author":"Sara Corbett",
"url":"http://www.vogue.com/11122973/sarah-harrison-edward-snowden-wikileaks-nsa/",
"content":"Since spiriting NSA leaker Edward Snowden to safety in Russia two years ago, activist and WikiLeaks editor Sarah Harrison has lived quietly in Berlin. Sara Corbett meets the woman some regard as a political heroine—others as an accomplice to treason.| Moscow’s Sheremetyevo Airport is, like so many international airports, a sprawling and bland place. It has six terminals, four Burger Kings, a sweep of shops selling duty-free caviar, and a rivering flow of anonymous travelers—all of them headed out or headed in or, in any event, never planning to stay long. But for nearly six weeks in the summer of 2013, the airport also housed two fugitives: Edward Snowden, the NSA contractor who had just off-loaded an explosive trove of top-secret U.S. government documents to journalists, and a 31-year-old British woman named Sarah Harrison, described as a legal researcher who worked for the online organization WikiLeaks.| It was a tableau sprung from a spy novel—a turncoat intelligence contractor on the lam with an enigmatic blonde by his side. Snowden had based himself in Hong Kong for several weeks as his disclosures about government surveillance ripped across the global media. When the U.S. charged him under the Espionage Act on June 14, an extradition order was sent to Hong Kong. But it came too late: Before anybody made a move to capture him, Edward Snowden—led by Sarah Harrison—had quietly boarded a flight to Moscow and basically vanished.| Their whereabouts at Sheremetyevo became a mystery. There was no sign of them at the lone hotel inside the terminal area, which rented out tiny “capsule” rooms for about $15 per hour. Nor did they turn up for a flight they’d booked to Havana, where reportedly they had planned to catch a plane to South America. In the meantime, the United States revoked Snowden’s passport. Word quickly spread that the world’s most wanted man was stuck inside the airport’s transit zone, unable to leave Russia and also, without a visa, unable to stay.| ‘Sarah refuses to allow intimidation to shape her decisions,’ comments Snowden. ‘If you forced her to choose between disowning her principles or being burned at the stake, I think she’d hand you a match’.| As questions swirled about Snowden, the mysterious Sarah Harrison almost escaped notice. A gossipy Washington Post item claimed she was “a product of a posh British boarding school.” It also repeated a widely circulated rumor that she was, at least at one time, the girlfriend of Julian Assange, WikiLeaks’ controversial Australian founder. Old file photos showed Harrison to be strikingly attractive, with long, ringleted hair and a vivid, gap-toothed smile.| If her job was to help keep Snowden safe and hidden, she did it masterfully. For 39 days, the two managed to camp out in the airport transit zone, foiling the media hordes trying to find them. TV crews patrolled the restaurants and pay-to-enter VIP lounges. Reporters grilled airport staff about what they knew, which was invariably nothing. “I’ve spent up to eighteen hours a day beyond passport control and security looking for Snowden,” an ABC News employee reported glumly in a blog post a week into the hunt. “There is an irrational fear, even late at night, that the moment I call it quits he’ll come strolling down the hall. . . .”.| And then on August 1, 2013, Snowden did exactly that. Appearing shy and pale, he strolled down a hallway and exited Sheremetyevo, having been granted a yearlong asylum by Russia. By his side was the portly Muscovite lawyer who’d assisted with the asylum effort and also Harrison, wearing leggings and a black tank top, grinning broadly. Where or how they’d subsisted in the airport remained a secret. For the next three months, Harrison stayed on in Moscow with Snowden, the two of them living in an undisclosed location before finally, late in 2013, without a lot of fanfare, she moved to Berlin, saying that her lawyers had advised her against returning to the U.K., where she could be detained under the country’s sweeping antiterrorism laws.| One might assume Harrison would have gone on to do a splashy network TV interview or pen one of those “I was there” books about shepherding Snowden through what had to count as one of the most perilous and closely watched legal limbos in recent history. But she didn’t. She remained relatively quiet, resuming her work for WikiLeaks. Harrison, it turns out, is very, very careful about what she says. To hear her story, you have to go find her.| I first meet Harrison late on a November afternoon at a café in central Berlin. Dressed in faded jeans, a leather jacket, and fawn-colored boots, she sits at a small outdoor table with a cup of hot coffee, impervious to the chill in the air. She has broad cheekbones, a frank blue-eyed gaze, and wavy russet-colored hair, which she keeps pulled back from her face with a clip. She laughs frequently and robustly, which is a little surprising, given that she’s often talking about sobering things like government surveillance and freedom of information.| Our get-together has taken months to arrange. Harrison, whose work has helped shake governments and shape world events, is not easy to reach. There’s no contact information for her on the WikiLeaks Web site, where her job title is now “investigations editor.” She’s also one of the founders and the director of a newly formed whistle-blower-protection organization called the Courage Foundation, but there’s no email listed for her there, either. She’s not on Twitter or Facebook or Linked­In, nor does she own a phone. I’d connected with her, finally, through a mutual acquaintance who’d agreed to forward an email, which then led to a protracted back and forth.| Now that we’re face-to-face, she politely makes two requests: She’d like me not to name places where we meet and also not to reveal the brand of laptop she uses, because it could make her more vulnerable to getting hacked. She explains that the bars and restaurants she hangs out in are frequented by other members of Berlin’s burgeoning community of privacy and civil liberties activists—“Snowdenistas,” they’ve been called—including American filmmaker Laura Poitras, whose documentary about Snowden, Citizenfour, is a strong contender for an Academy Award. It’s a close-knit circle of people who look out for one another carefully, and this extends to keeping potential eavesdroppers out of the group’s preferred watering holes.| Harrison smiles, knowing she can come off as a bit paranoid. “It’s better to err on the side of caution,” she says with a shrug. To this end, she’s taught her parents and close friends how to use encrypted email. And because mobile phones can be used to track a person’s location, she hasn’t carried one in years. (“You just get used to it,” she says.) She doesn’t necessarily believe she’s being monitored in real time, but given her association with Snowden, who has been charged with multiple felonies in the U.S., and her work with WikiLeaks, helping to release hundreds of thousands of classified documents mostly provided by whistle-blowers, she says that when it comes to government intelligence agencies, “I’m obviously a person of interest.”| The work she does requires a meticulous attention to detail and strong nerves. Much of Harrison’s time goes to verifying the authenticity of documents passed on to WikiLeaks and writing reports on their contents, which get published on the Web site alongside the raw material—often over the howls of government officials. These document releases have been delicate and controversial, shedding light on everything from civilian casualties in Iraq to U.S. policies for detainees at Guantanamo Bay and the specifics of CIA assassination programs.| In many ways, Harrison seems born for the job. As a child, she was a compulsively organized bookworm who kept her shelves ordered both alphabetically and by category. She was also politically emboldened early: Around the age of eight, she fired off a letter to Britain’s prime minister, John Major, offering suggestions on how he might address homelessness. (She got a friendly form letter in return.) The daughter of a retail-industry executive and a literacy specialist, she went on to attend a private school in Kent and then punctuated her university studies in London with long breaks to travel, especially through Asia and Australia, supporting herself by waitressing and freelance jobs. It was the travel, she says, that introduced her to the world’s vast inequities and planted the idea that she could apply her fastidiousness to a larger cause. Back in London in 2008, she took an internship at the nonprofit Centre for Investigative Journalism, quickly distinguishing herself as a skilled researcher.| When Julian Assange went to England in the summer of 2010 and contacted the center’s director, asking for help making an archive of 75,000 documents from the Afghan war available to select media outlets, Harrison volunteered immediately. What was supposed to be a two-week job quickly evolved into a staff position. She became indispensable to Assange, as a confidante and right-hand person.| Though some suggest a romantic liaison, Harrison won’t confirm whether she was—or is—involved with Assange. “We’ve never commented on that,” she says with just a hint of frostiness. She admits to being half-entertained and half-offended by the way she’s been described in the media—seeing words like schoolgirl, companion, and lover used in headlines. Some of it seems overtly sexist, and some driven by how little is actually known about her. There have been reports that while in England, Harrison did Assange’s laundry and that, with her cheery demeanor and disarming laugh, she helped smooth over his often-prickly interactions with the press. When Harrison surfaced by Edward Snowden’s side in Moscow, an Italian paper wondered aloud if she might be a twenty-first-century Mata Hari. “I think, because there was such a void of information, the only way the press could speak about me was to identify me by the men I worked with,” she says lightly. “And sometimes they did it in quite a snarky way.”| These days, Harrison lives something of a double life in a leafy gentrified area in East Berlin, wedged between the more modernized urban center and the concrete-slab tenements left over from the city’s Stalinist era. Still an avid reader, she’s a fan of Murakami and lately has been reading novels about the French Resistance. In the evenings, she sometimes hits yoga classes or meets friends for drinks, but her days are spent largely on her computer at home alone. She and Assange remain in regular touch professionally, though they haven’t seen each other in nearly two years. Both are limited in their movements. Harrison doesn’t plan to return to England until the terrorism laws are changed.| Meanwhile, Assange has spent more than two years wanted for questioning in Sweden, where he’s been accused of sexually assaulting two women during a trip there in 2010, just after Harrison met him. (Assange, who hasn’t been charged with a crime, insists the allegations are false and part of a broader conspiracy to damage his reputation. Harrison dismisses the case as “deeply politicized.”).| WikiLeaks, of course, has plenty of critics—those who maintain that classified documents are classified for good reason. But Harrison feels otherwise: “Members of the public should know what their government is doing,” she says simply. Though WikiLeaks has a small staff and operates on a shoestring (a number of prominent financial organizations, including Visa, MasterCard, and PayPal, refuse to process donations to the group), it has managed to provoke large institutional adversaries, most notably the U.S. government. There’s a nimbleness that comes with being small, Harrison tells me. “Sometimes it’s easier to be a rowboat than a tanker ship.”| Just then, a waitress sets a fresh cup of steaming coffee on the table. Harrison, who has been speaking rapid-fire for nearly an hour, pauses to smile warmly and say thanks. The waitress is about her age and an English-speaker. She gestures at Harrison’s cup. “How many is this?” she says in a teasing voice. “Four?” Harrison bursts out laughing. For all her worries about privacy, it’s her caffeine intake that’s being monitored.| “It’s three,” she tells the waitress, waving a hand and pretending to be chastened. “And I’m stopping here.”| That evening, we walk to a nearby office for a meeting with two of the Courage Foundation’s Berlin-based advisory-committee members—Renata Avila, a Guatemalan human rights lawyer, and Andy Müller-Maguhn, a well-known German “hacktivist.” In a small conference room borrowed from another nonprofit, Harrison flips open her laptop and starts briskly running through her agenda. Pinned to the wall behind her is a poster of Che Guevara.| The Courage Foundation is still very much in a grassroots stage, with fund-raising being an obvious and immediate goal. Harrison is in the process of developing a network of people—an Underground Railroad of sorts—that can mobilize quickly to shield a whistle-blower at risk. She also plans to set up an advisory system for journalists to improve their online security and better protect their sources. Harrison reports to the group that she has been organizing a statement in support of Snowden, which would be published the following week, signed by celebrities like Susan Sarandon, M.I.A., and Alfonso Cuarón. She’s also actively recruiting new advisory-board members, the most recent among them Nadya Tolokonnikova and Masha Alekhina of the Russian punk group Pussy Riot.| Much of the conversation with Avila and Müller-Maguhn involves strategizing about who else might join their cause. Someone mentions that Lady Gaga once came for tea with Assange at the Ecuadoran embassy—maybe she could be approached? There’s also discussion of how to customize the foundation’s basic Web site to quickly tell any new whistle-blower’s story, including a tab for accepting donations. It’s a lesson Harrison learned at the Moscow airport, trying to help set up a defense fund for Snowden: Scrambling only makes things difficult. Next time a figure like Snowden emerges—and they seem convinced there will be a next time—they want to mobilize in an instant. “We already have bank accounts set up,” she tells the others, sounding confident. “We can go within a matter of days, if not hours. . . .”| Edward Snowden’s arrival into Sarah Harrison’s life in June 2013 was not unlike his arrival on the world scene—which is to say mind-spinningly sudden. Harrison was in Melbourne, Australia, on WikiLeaks business. Assange, who had been in touch with Snowden, called her on a Monday morning. Given the time difference, “I thought he was talking about the mountain in Wales,” Harrison admits, referring to Mount Snowdon, a legendary peak in the U.K. As Melbourne was relatively close to Hong Kong and Harrison had a working knowledge of the city, she was dispatched immediately and secretly to canvass foreign embassies to see which countries might be amenable to granting Snowden asylum.| She laughs, recalling the moment she flew to Hong Kong, saying she left half her luggage in Melbourne, thinking she’d return shortly. Meanwhile, nearly two years later, she hasn’t been back, nor has she gone to England, where the rest of her belongings reside. “I’ve got clothes everywhere,” she says.| Harrison says that for the thirteen days in Hong Kong, she consulted with various lawyers about the complexities of Snowden’s situation, and Assange, meanwhile, worked his connections in the Ecuadoran government to obtain diplomatic protection for the NSA leaker’s travels. WikiLeaks, she says, booked more than a dozen different flights for Harrison and Snowden, hoping to throw off any pursuers. “We also got Snowden to buy a ticket to India on his own credit card,” Harrison says. “We were working very hard to lay as many false trails as possible.” It was an excruciatingly anxious time. “I just kept hoping the tickets would be OK’d,” she says. She passed her parents’ phone number on to one of the lawyers, asking that they be contacted if something went wrong.| “She really put herself on the line,” says Laura Poitras, who filmed Snowden in his hotel room until the day after he revealed his identity publicly, at which point she had to back off in order not to jeopardize him. “I was being tailed,” she says. “The risks became very great.” Harrison had the right mix of steeliness and conviction to get him out of Hong Kong. “She’s extremely intelligent,” Poitras says, “and tenacious. And very motivated by her principles.”| Harrison says she didn’t actually meet Snowden until they climbed into a car together on Sunday morning to head to the airport. Harrison was dressed in jeans and flip-flops. Snowden, too, looked casual. The idea was that they might pass for a young couple headed off on vacation. On the drive, they said very little. “I was just so nervous and concentrated on the next steps,” she remembers.| They boarded the Moscow-bound Aeroflot plane, and it wasn’t until the plane was airborne that Snowden turned to her and spoke what was almost his first complete sentence: “I didn’t expect that WikiLeaks was going to send a ninja to get me out.”| Harrison says that she and Snowden disembarked in Moscow and went to check in for their next flight, which is when they learned of his canceled passport. Citing “security reasons,” she won’t provide specific details about where they stayed during the days that ensued, saying only that they shared a single, windowless room, did their laundry in the sink, watched movies on their laptops, and quickly grew tired of airport food. “If I have to ever eat another Burger King meal, I’ll die,” she says. The intimacy of the situation may have been uncomfortable, but it was also deliberate. “If anything untoward happened to him, I was there as a witness,” Harrison says, adding that WikiLeaks, with its ability to reach a vast global audience, served as a form of protection. “We would have made sure that the world knew.” She claims to have wandered the airport terminals freely, despite the roving media. “For girls, it’s a bit easier to fit in,” she tells me, saying that putting her curly hair into a bun served as enough of a disguise.| Harrison describes having a collegial friendship with Snowden. What pains her most are the accusations that he betrayed his country. Both she and Snowden have said that he was approached by Russian intelligence agents during their time at Sheremetyevo, but that he turned them away. “The last thing in the world he is,” Harrison says, “is a traitor and a spy.” She jokingly describes how Snowden quoted the U.S. Constitution so often in their conversations about the NSA’s overreaching programs that it ultimately grew annoying. “It got to the point where I was like, ‘All right, all right, the Constitution!’ ” More seriously she adds, “He’s the strongest patriot of any American I’ve ever met.”| Jacob Appelbaum, an American journalist and computer-security researcher who is based in Berlin, says that Harrison is something of an unsung hero. “She really saved Snowden’s life,” he says, noting that she’s now “basically in exile” in Berlin. “It’s a heavy price to pay.”| Snowden himself is aware that it was, in part, Harrison’s commitment to his cause that got him out of peril. In an email sent from Russia, he tells me that his lawyers initially informed him that it was dangerous for anybody at all to help him, that “anyone within a three-mile radius is going to get hammered.” But still, Harrison stepped forward. She could have left Moscow at any time but chose instead to stay—not for days or even weeks but for months. This, according to Snowden, is in keeping with her character. “In the face of very real risks, Sarah refuses to allow intimidation to shape her decisions,” he writes. “If you forced her to choose between disowning her principles or being burned at the stake, I think she’d hand you a match.”| On my final night in Berlin, I join Harrison for the German premiere of Citizenfour, which is held in a beautiful theater near Alexanderplatz and packed with people from Berlin’s tech and activist communities. Among them, Harrison, wearing a skirt and a pair of dangly earrings, is a minor celebrity, accepting hugs and handshakes. Laura Poitras is also on hand, looking modest and a bit drained. The film has already had premieres in London, Los Angeles, and New York, and is due to air on HBO at the end of February.| If there’s cynicism in the Berlin crowd regarding Snowden, it’s impossible to detect. Germany, in general, has shown more receptivity to Snowden’s cause than other countries, particularly the U.S., where opinions remain divided. There are reports of German homes displaying signs that read, i have a bed for ed.| As the theater lights dim, Harrison puts on a pair of eyeglasses and sinks down in her seat. Someone hands her a glass of champagne, which she sips slowly in the darkness as the film starts to roll, and after a time, Edward Snowden’s face appears on the screen. The film is shot almost entirely inside a Hong Kong hotel room. Snowden comes across as thoughtful, intelligent, committed, and also under mounting duress. It leaves off at almost precisely the moment Harrison steps in.| Next to me, Harrison says nothing until the movie is over and the audience is applauding wildly, clearly won over by the whistle-blower’s audacity. When I ask if the man on-screen reflects the man with whom she went on to spend four months, whose plight decidedly changed her own, she nods her head. “That’s him,” she says. “Exactly.” Earlier, she’d told me that part of the reason she stayed with Snowden was to help him become a symbol, to demonstrate to others that it’s possible to speak out and still live freely. There was a touch of triumph in her voice as she said it. “I’m not saying Snowden’s got the best situation in the world,” she said. “But basically, he’s free.”"}