{"title":"How to Make College Cheaper",
"author":"Steve Cohen",
"url":"http://www.nytimes.com/2015/02/25/opinion/how-to-make-college-cheaper.html?ref=opinion",
"content":"THE soaring cost of college — a 1,225 percent increase since 1978, nearly twice the rate of the rise in health care costs — is such a problem for most families that politicians across the ideological spectrum are actually taking notice.| President Obama has proposed making two years of community college free. Senator Bernie Sanders of Vermont, speaking in Iowa last week, raised the stakes by arguing that federal and state governments should split the cost of reducing tuition at public universities and colleges by more than 50 percent. And Gov. Scott Walker of Wisconsin just proposed a two-year extension of the tuition freeze currently in place at the University of Wisconsin, which he coupled with a 13 percent cut in state aid and the suggestion that professors teach one more course per semester.| The issue transcends traditional political battle lines because it is middle-class families who are most affected by tuition hikes. They are largely ineligible for most government scholarship programs. And except at the most elite universities, colleges’ own grant programs don’t kick in until after the family has met its unrealistically high “expected family contribution,” which is calculated by the federal government.| As a result, families rely on a mix of government and private loans to pay these horrendous costs. On average, students are graduating with $33,000 in loan obligations, and parents often borrow even more. The interest rates these borrowers pay can be as high as four times the rate for an auto loan.| There is a solution that can make college more accessible and affordable for middle- and lower-income students: tuition deferment. Colleges should offer an alternative to traditional loan programs by allowing students to defer up to 75 percent of the cost of attending school — tuition, room, board and fees — and pay it back over 20 years.| Repayment would be based on a sliding percentage of what the student defers and then later earns. So a graduate who becomes a teacher would pay far less than one who becomes an investment banker. (Government loan programs have begun offering income-based repayment options, and their popularity is surging. That’s because the monthly payments are affordable, capped at 15 percent of disposable income, which has resulted in lower default rates. As of July, new borrowers are capped at 10 percent.)| College-based tuition deferment would be more attractive to students than government (or private) loans because the interest rates could be much lower. Federal loan programs charge students 4.66 percent plus an origination fee of 1.1 percent. For parents who are creditworthy, the government’s interest rate is an outrageously high 7.21 percent, plus an origination fee of 4.3 percent. Plus there are annual limits on the amount students can borrow ranging from $5,500 to $7,500. As a result, families with spottier credit histories are forced to turn to private loans, which are currently charging as much as 12 percent interest.| In a tuition-deferment plan, it is the college that is borrowing capital to offset its cash-flow needs because of the deferred tuition, not the student or parent. The college’s borrowing cost would be substantially lower than what individuals have to pay for current loan programs because colleges have collateral: endowments, physical assets and future cash flow. The resulting interest rate passed along to student participants could be as low as car loans (around 3 percent) or home mortgages (around 3.5 percent).| So why would colleges take on the risk of students’ defaulting and the cost of implementing a tuition deferment plan? Because it is in their self-interest to do so. Colleges are facing serious problems with middle-class families because of out-of-control tuition hikes and out-of-sync priorities. I spoke recently to 300 college presidents, admissions deans and financial aid directors at the College Board’s annual Higher Ed Colloquium. My talk was based on recent survey research of families by the education site Noodle.| The Noodle survey, which polled 985 parents, revealed that their priorities were quite different from those of the colleges. Nearly three-quarters of parents want their children to acquire marketable skills, which is slightly higher than the percentage who want their children to get a first-rate academic experience. The only other factors in the same range of importance seem obvious: a safe environment and a good fit.| Paying for college was also a serious concern. Two-thirds said that they would recommend only those colleges that offered a substantial financial aid package to their children, and 52 percent said they would suggest that their children attend a year or two of community college as a way to make college more affordable (and that was before the president’s proposal to make community college free).| To hang on to their middle-class customers, schools need to convince families that the investment of hundreds of thousands of dollars is worth it. One way for them to do that is to invest in their students through tuition deferment. It would demonstrate that the college has confidence in its programs and in its ability to educate and prepare graduates for the real world. Early adopters would reap special benefits in the competition for students. And by shifting the risk of student default from the government to their own balance sheets, colleges might just show a bit more restraint when it comes to tuition hikes."
}