{"title":"The Internet of Anything: The System That Pays You to Use Less Electricity",
"author":"Klint Finley",
"url":"http://www.wired.com/2015/02/ohmconnect/",
"content":"We all know we should use less electricity. It would save us some money each month, and in the long run, it just might save the planet, reducing our collective carbon footprint. But sadly, that’s just not enough incentive for most of us.| Ohmconnect hopes to provide more. Launched about a year ago, the service doesn’t just help you save electricity. It pays you—or your favorite charity—when you use less power during volatile times for the electrical grid. And if you have the right gear—such as a Nest thermostat, Belkin smart switches, or a Tesla car—Ohmconnect can automatically manage some of your power consumption so that you don’t have to do anything yourself.| “Users typically earn between $50 and $150 per year, depending on how much electricity they typically use,” says co-founder Curtis Tongue. So far, the service is only available in California, but Tongue says that company will expand into other states, such as Texas, as they adopt the regulations that enable Ohmconnect to sell energy on the open market.| At least in theory, this can not only cut down on emissions - the power plants that operate during peak times tend to have bigger carbon footprints - but also help make the electrical grid more stable by reducing activity spikes, which could it easier to make the transition to cleaner energy sources such as solar and wind power.| The process is simple. You sign-up for Ohmconnect and authorize the company to access your home’s smart meter and any supported internet-connected devices. You don’t have to buy or install any special equipment. A few times a week, the company will alert you to energy spikes and ask you to cut back your power consumption, or it will dial-it back for you through the Nest and other devices. Then you get paid for the energy you don’t use.| It starts with California ISO, the organization that manages the state’s electrical grid. The ISO creates forecasts of how much energy each customer is expected to use during different periods of time. And when too many customers exceed these forecasts, additional power plants have to be activated to meet the demand.| Firing up these “peaker” plants is expensive, so utility companies would rather pay people to use less electricity than pay to turn the plants on, so they buy unused power through energy markets, even though no new power is actually being generated.| Ohmconnect monitors these energy markets, and when prices spike, it can text you to let you know to wait to run your dishwasher or dry your laundry for a couple hours. Or it might tell your Nest thermostat to turn down the heat or air conditioning for an hour. Or it could tell your Tesla to stop charging until prices go back down.| If you manage to use less than your forecasted amount of electricity, you earn money that you can either collect via PayPal or have donated directly to a charity of your choosing.| On your own, you’d never save enough energy to make money selling on the energy markets. But Ohmconnect can help large groups of customers save energy, and sell their energy as a bundle.| There are companies that bundle energy sales for commercial properties, but Tongue says Ohmconnect, which takes a 20 percent cut of the earnings, is the first to do this for residential consumers."}
