{"title":"U.S. Drops to 49th in World Press Freedom Rankings, Worst Since Obama Became President",
"author":"Glenn Greenwald",
"url":"https://firstlook.org/theintercept/2015/02/12/u-s-drops-49th-world-press-freedom-rankings-second-lowest-ever/",
"content":"Each year, Reporters Without Borders issues a worldwide ranking of nations based on the extent to which they protect or abridge press freedom. The group’s 2015 ranking was released this morning, and the United States is ranked 49th.| That is the lowest ranking ever during the Obama presidency, and the second-lowest ranking for the U.S. since the rankings began in 2002 (in 2006, under Bush, the U.S. was ranked 53rd). The countries immediately ahead of the U.S. are Malta, Niger, Burkino Faso, El Salvador, Tonga, Chile and Botswana.| Some of the U.S.’s closest allies fared even worse, including Saudi Arabia (164), Bahrain (163), Egypt (158), the UAE (120), and Israel (101: “In the West Bank, the Israeli security forces deliberately fired rubber bullets and teargas at Palestinian journalists”; 15 journalists were killed during Israeli attack on Gaza; and “the authorities also stepped up control of programme content on their own TV stations during the offensive, banning a spot made by the Israeli NGO B’Tselem that cited the names of 150 children who had been killed in the Gaza Strip”).| To explain the latest drop for the U.S., the press group cited the U.S. government’s persecution of New York Times reporter Jim Risen, as well as the fact that the U.S. “continues its war on information in others, such as WikiLeaks.” Also cited were the numerous arrests of journalists covering the police protests in Ferguson, Missouri (which included The Intercept’s Ryan Devereaux, who was tear-gassed and shot with a rubber bullet prior to his arrest).| It should come as no surprise that the U.S. continues to plummet in press freedoms under Obama. In October, 2013, the Committee to Protect Freedom issued a scathing denunciation of the U.S. government’s attacks on press freedoms, the first time the U.S. was ever the subject of one of its reports. Written by former Washington Post executive editor Leonard Downie, Jr., it detailed the multiple ways the Obama administration has eroded press freedoms, and concluded:| The administration’s war on leaks and other efforts to control information are the most aggressive I’ve seen since the Nixon administration, when I was one of the editors involved in The Washington Post’s investigation of Watergate. The 30 experienced Washington journalists at a variety of news organizations whom I interviewed for this report could not remember any precedent.| That warning echoed the one previously issued by James Goodale, the General Counsel of The New York Times during the Pentagon Papers battle, who said: “President Obama wants to criminalize the reporting of national security information” and “President Obama will surely pass President Richard Nixon as the worst president ever on issues of national security and press freedom.”"}