{"title":"How Services Like Uber Have Changed My Life",
"author":"Evan Trost",
"url":"https://medium.com/@evantrost/why-i-use-uber-526b8af1b75a",
"content":"Getting around without driving is not a decision for me, but a part of life. I was born visually impaired, and despite numerous operations still have no peripheral vision and little depth perception. Although I have decent sight in my left eye, I am almost blind in my right one. However, with medical advances, the best doctors I could have asked for and a fair amount of luck, I am able to do most things in life fairly easily, from watching a movie to reading the news. There are a few things that still remain difficult, like seeing if there is anything in front of me as I walk home on a dark street. Picking up facial cues across a crowded room has also seemed, at times, impossible (or flirting across a bar; thank you online dating services for alleviating this issue, but that’s another article). And, of course, driving.| I’ve tried to learn to drive. I’ve gotten and continue to maintain my Learners Permit, taken lessons, and almost totaled my parents’ car while driving around empty parking lots. I’ve consulted with doctors, who have said although I can legally pass a road test, it is not an advisable endeavor. Everyone I know has been supportive, but ultimately has persuaded me to accept the fact that it is not in my best interest or anyone else’s to get behind the wheel.| Luckily, I grew up in New York City, where driving is rarely needed to get anywhere. But anytime I’ve left the city, I’m suddenly confronted with a situation that consistently reminds me of my limitations. I have been stuck and unable to get around, needing to rely on unpredictable and very limited public transportation, taxi services or rides from anyone I could find. I’ve felt restricted when I visited Los Angeles, for both business and leisure, and forced to take their undependable and prohibitively expensive cabs. I’ve felt demoralized when I worked a political campaign in Delaware and either had to rely on my co-workers to drive me around, or the erratic once-an-hour bus for-only-part-of-the-day bus system that picked me up on the side of a highway. I’ve even felt confined in when I have left the center of New York City itself, when on one New Years Eve I had to wait for an hour at a Burger King in suburban Queens for my friend to pick me up.| But services like Uber and Lyft have changed all that. They have provided me with the freedom to go where I want when I want, and the confidence to believe that I will be able to do so with the minimum amount of hassle. I’ve travelled to places in the early morning or late at night without a second thought of being stranded into a new city or neighborhood, from the Newark’s Ironbound district to the outskirts of Philadelphia. I’ve felt confident enough to look for career opportunities in places as far as Seattle and Detroit, knowing if I were to move there, I would be able to get to work on time. I’ve even been self-assured enough to explore Tel Aviv on my own, knowing that when I wanted to get back to my hotel all I had to do was press a button.| These businesses are more than just a nice car that allows me to travel in a timely, convenient and comfortable way. It is a lifeline. It has provided me, and probably many others with physical limitations, with the ability to move past their restrictions. I now feel free to enough to go where I want, when I went, and know that I can still get back home, something that only a few short years ago I never thought was possible."}