{"title":"That ;) You Type Can and Will Be Used Against You in a Court of Law",
"author": "Julia Greenberg",
"url":"http://www.wired.com/2015/02/emoji-in-court-cases/",
"content":"On January 15, Osiris Aristy opened up Facebook, posted a photo of a gun and wrote, “feel like katxhin a body right now.” Later that night, he added, “Nigga run up on me, he gunna get blown down” and followed that with an emoji of a police officer and three gun emoji pointing at it. After an hour, he posted another similar message.| Three days later, Aristy, 17, was arrested by New York City police at his home in Brooklyn. According to a criminal complaint, the teen was charged with making a terroristic threat, along with charges of weapon and marijuana possession. His posts, the complaint argued, constituted a threat against police. They felt intimidated and harassed—emoji and all. o_O| Emoji are the language of our online era, the thumbs-up to a question, the wink to our wit, the peach to our eggplant. They’re a splash of color in black and white communication, conveying things mere words often cannot. We send emoji to improve upon, even expand, our words and bring emotion—affection, frustration, love, anger—to the conversation. Now, like the tweets, posts, and texts that are a crucial part of the way we communicate today, emoji, and their brethren emoticons, are finally getting their due in court. And like everything we love online, it’s complicated, kind of.| Several recent arrests and prosecutions have included, at least in part, emoji. At the beginning of the recent Silk Road trial of Ross Ulbricht, US District Judge Katherine Forrest ruled “the jury should note the punctuation and emoticons” in all evidence. (In the trial, attorneys then, quite literally, said “emoticon” when the symbols appeared in chat conversations.) In a case currently pending before the US Supreme Court, Anthony Elonis, a Pennsylvania man who was convicted for using Facebook posts to threaten his ex-wife, has claimed that a threatening post toward her was clearly meant in “jest” because he included a smiley sticking its tongue out.| None of these cases relied solely on the emoji, of course. Evidence, arrests, and prosecutions are far more complicated than that. But, as social media becomes increasingly important evidence for law enforcement, so too do emoji. When the digital symbol for a gun, a smile, or a face with stuck-out tongue comes up in court, they aren’t being derided or ignored.| When you talk to someone in person, you hear the intonation of their voice, see the cringe of their face, and react to the movement of their body. Online, we have only words. “If I were texting or emailing you, you couldn’t get that,” says Tyler Schnoebelen, a linguist and the founder of Ibidon, which helps companies analyze and understand language data from emails, chats, and social media. “I might do other things—add emoji or emoticons, words like LOL, or include multiple vowels, like soooo, just so you have a sense of how I’m emoting.”| Such things can stand in for a facial expression, or clarify context. They can transform a sentence that seems serious into a joke, or make what seems to be a joke serious. They can be playful, sarcastic, ambiguous, and dirty. Sometimes, they replace words altogether.| And if someone is to fully understand a text phrase or conversation—to truly parse what we were saying—they cannot be left out. That means that in court—if the larger piece of evidence is seen as authentic and admissible—the emoji should be read or shown, too.| Yet this can quickly get complicated because it’s not always clear what emoji mean. For investigators, attorneys, and jurors trying to determine, or prove, the intent of a phrase, as in the Elonis case, it’s often much more complicated than : ) means this past sentence was pleasing. Maybe the person was being polite. Maybe they were trying to dull a blow. Maybe it’s an evil grin and the person is being ironic. Without the context of who is using the symbol, who received it, and an understanding of how those two people—or the people in their community—typically use it, the intent may not immediately be clear.| We all use emoji, and we all have opinions. So, it’s no surprise that the recent public reaction to emoji cropping up in evidence has been somewhat frenetic. “What do Emoji mean?” asks The Atlantic, while wondering if they’re “vital.” Mashable says the law around emoji is “murky.” The New York Times considers “how jurors should be educated about unfamiliar terms” in cases with web evidence. And BuzzFeed says, well, let’s just blame 9/11. These questions, in part, are real and important—we don’t always know what emoji mean and, sure, they may be unfamiliar. But, besides tweaking already common practices, emoji shouldn’t change all that much in court.| Because what we mean when we use language is never crystal clear, and never has been. “Emoji are new, so they haven’t been conventionalized,” Schnoebelen explains. “But they work like a lot of other things that we know. And, just like with any particular word or a laugh, it’s pretty dangerous to say that you know what’s happening, what the intent is, based on one symbol.” Part of the role of a prosecutor in a criminal trial, like in the case of a threat, can be to demonstrably prove intent—and that is complicated both with emoji or without.| To help clarify intent, technical language, or slang, attorneys may ask witnesses or defendants to explain the meaning of the language they used or read. “To me, emoji are no different than drug slang in a criminal controlled substances case,” explains Greg Hurley, an analyst for the National Center for State Courts who spent a decade as a criminal defense attorney. “They may need some interpretation in some situations, in others the content may be obvious.” Want to know what an emoji implies? Ask. (Which is exactly what happened at one point in the Silk Road trial.)| And, even if a juror unfamiliar with emoji might misunderstand or misinterpret their meaning at first, they can learn. “More users pick up on the conventions after interacting for a while with others who use them,” says Susan Herring, a professor of information science and linguistics at Indiana University Bloomington. “Emoji in isolation could cause some puzzlement, but in the context of a textual message, though, the sender’s intended meaning of an emoji is usually clear.” Because humans are smart! We’re used to dealing with the complexities of language. With some context and explanation, we can, usually, figure it out.| Like the rest of us, when it comes to emoji, the courts are figuring it out. Last week, Aristy’s criminal charge of making a terroristic threat was dropped, according to his attorney, Fred Pratt. A decision in the Elonis case, which deals predominantly with more complex First Amendment questions about threats, is pending. Ulbricht was convicted of all seven charges against him in the Silk Road case.| Emoji were, at most, a sideshow for all of these trials, but they have become an integral part of our digital life. And that means they, like the tweets and texts and IMs we so often send, will increasingly be offered as evidence in court.| So, remember, anything you ; ) can and will be used against you in a court of law – but, that’s true of what you say, too."}