{"title":"Lashing Out in Verse",
"author":"Alison Smalea",
"date":"04/02/2014",
"url":"http://www.nytimes.com/2014/04/03/books/young-immigrant-in-denmark-lashes-out-in-verse.html",
"content":"LEIPZIG, Germany — Like many teenagers, Yahya Hassan does not lack for bravado. But his way of expressing it stands in stark contrast to that of most of his peers: At just 18, the Danish-Palestinian Mr.Hassan has emblazoned himself on Denmark’s consciousness with a poetry collection that appeared with a first print run of 800 last fall and has since sold more than 100,000 copies.| The collection, which criticizes the Danish welfare state, his family and Danish Muslims at large for hypocrisy, cheating and failure to adapt, has won him death threats as well as a dubious embrace by right-wing politicians. But his commercial success is reaching far beyond Denmark’s population of 5.5 million.| Many eyes were turned to Mr.Hassan last month when Ullstein, the German publishing house, rushed out a German translation of his Danish-language verse collection, “Yahya Hassan,” in time for the Leipzig Book Fair. The translation sold 9,000 copies in the first week, an exceptional run for poetry, and the newspaper Frankfurter Allgemeine published a German version of the fierce poem Mr.Hassan wrote during his visit to the Kiev revolt against President Victor F.Yanukovych of Ukraine days before his fall in late February.| With his dark ponytail and mesmerizing way of chanting his verse, Mr.Hassan proved a forceful presence at the book fair, an annual event that drew 175,000 visitors in March.| Sporting giant sunglasses, and stylish in a tan jacket and checked trousers, he took the stage and rattled off in Danish six or seven of his poems seemingly almost in a trance, removing the sunglasses to reveal his eyes closed. Even to non-Danish speakers, this proved far more riveting than listening to the same poems repeated blandly in German translation.| Mr.Hassan left his hourlong reading abruptly, declining to sign any books. A few hours later, at a hotel opposite Leipzig’s railway station, he was asked why. “I was done,” he said in his cocksure way during a half-hour interview.| That kind of abrupt clarity marks both the verse — written and printed only in capital letters — and encounters with Mr.Hassan as well. By contrast, all but the basic outlines of his life are shrouded in some mystery.| Mr.Hassan, according to clues in his verse and published reports in Danish media, arrived in Denmark from a Palestinian refugee camp in Lebanon as a child. By the time he was 13, he was so much trouble to both his family and society that Denmark’s welfare state essentially made him its ward, shuttling him through a series of institutions. All the while, his contempt for the state and its actions toward him grew.| Or at least that is what he seems to want to have his readers believe. His anger at a violent father who, in Mr.Hassan’s account, displays tenderness only when visiting the mosque to pray, and his dismissal of welfare workers and what he portrays as their pathetic attempts to make him happy, burn with the veracity of firsthand experience. But other aspects of his journey are less clear. For instance, few clues emerge about how he came to love literature, how he induced the police to bring him a copy of ‘’Crime and Punishment” or came to the attention of the literary intelligentsia.| Mr.Hassan gave few answers in the interview, but his texts suggest a few.| In one poem, “Contact Person,” he describes a teacher who returns an essay he has written with the remark that he must have copied it from the Internet. “I INSTANTLY WROTE HER A NEW ONE/ON THE LAST SCHOOL DAY BEFORE CHRISTMAS/SHE GAVE ME STRUNGE’S POETRY TO READ,” he writes, referring to Michael Strunge, a young Danish poet who committed suicide in 1986. At the end of the poem, a romance develops between student and teacher, the teacher divorces her husband, and Mr.Hassan moves away “on a frosty clear day in February.”| Who was this person, and what was the story? “I met a lot of people who gave me books and told me about writers and poets,” is all he would say.| A rapper before he became a poet, Mr.Hassan caught the attention of Johannes Riis, the literary director of the Gyldendal publishing house, who met him through other Danish literary figures. Mr.Hassan then wrote some 170 pages of poetry over the course of several months before publishing the first 800 copies of “Yahya Hassan” on October 19 Sales took off after an interview in the Danish daily Politiken whose headline, containing an expletive, quoting him on his hate for his parents’ generation. He describes a disciplinarian father who hits him and his siblings and eventually leaves to marry a second Muslim wife, and he criticizes his mother and other relatives.| He finds particular fault with the ways their lives in Denmark are circumscribed — as are those of so many modern immigrants — by clinging to the remote control that brings satellite TV, in this case Al Arabiya and Al Jazeera, to their living rooms. The images of life in the poorer parts of Aarhus, the port city where Mr.Hassan lived with his family, are bare and dirty. The language used to describe his various brushes with state institutions is rife with expletives.| His observations have appealed not just to the literary establishment, but also — despite the wildness and criminality in his poems — to the kinds of arguments advanced by the anti-immigrant Danish People’s Party. Of that connection, he said in the interview: “It’s all the same to me. I have the responsibility for my poems. I don’t have any responsibility for what others do with them.”| His perceived criticism of the Muslim world in Denmark earned him at least one assault, in a Copenhagen railway station, and dozens of death threats. In the country where the newspaper Jyllands-Posten stirred Muslim anger worldwide after it published cartoons of the Prophet Muhammad in 2005, and where the anti-immigrant right-wing won seats in Parliament relatively late — in the 1990s — existing emotions have helped keep the spotlight on Mr.Hassan.| “His talent is so explosive and elementary that I have no doubt it will prevail beyond the frenzied media blitz,” Lars Bukdahl, a Danish poet and poetry editor, said in an email. “He’s great at raging against everything and everyone, including himself, but at the same time, he has this strong eye for detail.” He also has an ability to mix ancient and modern, Rumi and Eminem, Mr.Bukdahl added.| The question now is whether he is just another teenage flash in the pan.| “He is only 18,” Mr.Riis said in a telephone interview from Copenhagen, “but the sheer force of his talent will drive him on.” Already, he said, Mr.Hassan has forced many liberals in Denmark to confront his critical observations of the welfare system and of how Danes cope with immigrants. “Nobody had really paid attention,” Mr.Riis said. “Now he came up with it, and everybody is forced to listen.”| Asked asked how he might see himself at 30, Mr.Hassan said he had no idea.| “I have no favorite poems,” he said. “I hate them all.” Are they a cry from the heart? “I do not cry. I depict with words.”| He added, “I don’t ask as many questions as journalists.”"}