{"title":"Mars One (and done?): MIT team independently assesses the technical feasibility of the proposed Mars One mission.",
"author":"Jennifer Chu",
"url":"https://newsoffice.mit.edu/2014/technical-feasibility-mars-one-1014",
"date":"10/14/2014",
"content":"In 2012, the “Mars One” project, led by a Dutch nonprofit, announced plans to establish the first human colony on the Red Planet by 2025. The mission would initially send four astronauts on a one-way trip to Mars, where they would spend the rest of their lives building the first permanent human settlement.| It’s a bold vision — particularly since Mars One claims that the entire mission can be built upon technologies that already exist. As its website states, establishing humans on Mars would be “the next giant leap for mankind.”| But engineers at MIT say the project may have to take a step back, at least to reconsider the mission’s technical feasibility.| The MIT researchers developed a detailed settlement-analysis tool to assess the feasibility of the Mars One mission, and found that new technologies will be needed to keep humans alive on Mars.| For example, if all food is obtained from locally grown crops, as Mars One envisions, the vegetation would produce unsafe levels of oxygen, which would set off a series of events that would eventually cause human inhabitants to suffocate. To avoid this scenario, a system to remove excess oxygen would have to be implemented — a technology that has not yet been developed for use in space.| Similarly, the Mars Phoenix lander discovered evidence of ice on the Martian surface in 2008, suggesting that future settlers might be able to melt ice for drinking water — another Mars One goal. But according to the MIT analysis, current technologies designed to “bake” water from soil are not yet ready for deployment, particularly in space.| The team also performed an integrated analysis of spare-parts resupply — how many spare parts would have to be delivered to a Martian colony at each opportunity to keep it going. The researchers found that as the colony grows, spare parts would quickly dominate future deliveries to Mars, making up as much as 62 percent of payloads from Earth.| As for the actual voyage to Mars, the team also calculated the number of rockets required to establish the first four settlers and subsequent crews on the planet, as well as the journey’s cost.| According to the Mars One plan, six Falcon Heavy rockets would be required to send up initial supplies, before the astronauts’ arrival. But the MIT assessment found that number to be “overly optimistic”: The team determined that the needed supplies would instead require 15 Falcon Heavy rockets. The transportation cost for this leg of the mission alone, combined with the astronauts’ launch, would be $4.5 billion — a cost that would grow with additional crews and supplies to Mars. The researchers say this estimate does not include the cost of developing and purchasing equipment for the mission, which would further increase the overall cost.| Olivier de Weck, an MIT professor of aeronautics and astronautics and engineering systems, says the prospect of building a human settlement on Mars is an exciting one. To make this goal a reality, however, will require innovations in a number of technologies and a rigorous systems perspective, he says.| “We’re not saying, black and white, Mars One is infeasible,” de Weck says. “But we do think it’s not really feasible under the assumptions they’ve made. We’re pointing to technologies that could be helpful to invest in with high priority, to move them along the feasibility path.”| “One of the great insights we were able to get was just how hard it is to pull this [mission] off,” says graduate student Sydney Do. “There are just so many unknowns. And to give anyone confidence that they’re going to get there and stay alive — there’s still a lot of work that needs to be done.”| Do and de Weck presented their analysis this month at the International Astronautical Congress in Toronto. Co-authors include MIT graduate students Koki Ho, Andrew Owens, and Samuel Schreiner.| The group took a systems-based approach in analyzing the Mars One mission, first assessing various aspects of the mission’s architecture, such as its habitat, life-support systems, spare-parts requirements, and transportation logistics, then looking at how each component contributes to the whole system.| For the habitat portion, Do simulated the day-to-day life of a Mars colonist. Based on the typical work schedule, activity levels, and metabolic rates of astronauts on the International Space Station (ISS), Do estimated that a settler would have to consume about 3,040 calories daily to stay alive and healthy on Mars. He then determined crops that would provide a reasonably balanced diet, including beans, lettuce, peanuts, potatoes, and rice.| Do calculated that producing enough of these crops to sustain astronauts over the long term would require about 200 square meters of growing area, compared with Mars One’s estimate of 50 square meters. If, as the project plans, crops are cultivated within the settlers’ habitat, Do found that they would produce unsafe levels of oxygen that would exceed fire safety thresholds, requiring continuous introduction of nitrogen to reduce the oxygen level. Over time, this would deplete nitrogen tanks, leaving the habitat without a gas to compensate for leaks.| As the air inside the habitat continued to leak, the total atmospheric pressure would drop, creating an oppressive environment that would suffocate the first settler within an estimated 68 days.| Possible solutions, Do says, might include either developing a technology to extract excess oxygen or isolating the crops in a separate greenhouse. The team even considered using nitrogen extracted from the Martian atmosphere, but found that doing so would require a prohibitively large system. Surprisingly, the cheapest option found was to supply all the food required from Earth.| “We found carrying food is always cheaper than growing it locally,” Do says. “On Mars, you need lighting and watering systems, and for lighting, we found it requires 875 LED systems, which fail over time. So you need to provide spare parts for that, making the initial system heavier.”| As the team found, spare parts, over time, would substantially inflate the cost of initial and future missions to Mars. Owens, who assessed the resupply of spare parts, based his analysis on reliability data derived from NASA repair logs for given components on the ISS.| “The ISS is based on the idea that if something breaks, you can call home and get a new part quickly,” says Owens. “If you want a spare part on Mars, you have to send it when a launch window is open, every 26 months, and then wait 180 days for it to get there. If you could make spares in-situ, that would be a massive savings.”| Owens points to technologies such as 3-D printing, which may enable settlers to manufacture spare parts on Mars. But the technology as it exists today is not advanced enough to reproduce the exact dimensions and functions of many space-rated parts. The MIT analysis found that 3-D printers will have to improve by leaps, or else the entire Mars settlement infrastructure will have to be redesigned so that its parts can be printed with existing technology.| While this analysis may make the Mars One program look daunting, the researchers say the settlement-analysis tool they’ve developed may help determine the feasibility of various scenarios. For example, rather than sending crews on one-way trips to the planet, what would the overall mission cost be if crews were occasionally replaced?| “Mars One is a pretty radical idea,” Schreiner says. “Now we’ve built a tool that we can play around with, and we can twist some of the knobs to see how the cost and feasibility of the mission changes.”| Tracy Gill, a technology strategy manager at NASA, says the tool may be applicable for assessing other missions to Mars, and points to a few scenarios that the group may want to explore using the settlement-analysis tool.| “This [tool] can provide a benefit to mission planners by allowing them to evaluate a larger spectrum of mission architectures with better confidence in their analysis,” says Gill, who did not contribute to the research. “Included among those architectures would be options ranging from completely growing all food in situ with bioregenerative systems, to packaging all food products from Earth, to various combination of those two extremes.“| Some of the students on this project were supported by NASA fellowships."}
