{"title":"How the Chapel Hill Victims Deserve to Be Mourned",
"author":"Moustafa Bayoumi",
"url":"https://firstlook.org/theintercept/2015/02/12/chapel-hill-victims-deserve-mourned/",
"content":"I didn’t know Yusor Mohammad, Deah Shaddy Barakat or Razan Mohammad Abu-Salha — the victims of Craig Stephen Hicks’ shooting spree in Chapel Hill, North Carolina — but I recognize them. Anyone who has spent time in American Muslim communities would, and that’s partly why this horrible crime is so painful. I realize I’m making assumptions and maybe getting sentimental in the process, but I can’t help it. The personalities that come through from the testimonies of friends and family, the record of the efforts and achievements of these young people, and the photographs that radiate such joy and life are all too familiar to miss.| Yusor, Deah and Razan — may they rest in peace — are like so many young American Muslims I know. These are hard-working, well-meaning, family-oriented people. Muslim communities around the country are full of Yusors, Deahs and Razans, and they are the ones who are out there, inspiring the older generation out of their despair at the state of the world by their actions. These young American Muslims are the ones who think deeply about inequality at home and injustice abroad, and act on both. They are the ones who will volunteer to deliver food (or dental supplies) to the needy while organizing assistance for Syrian refugees abroad. They are the people who are never searching for outside recognition for their efforts but who are acting out of their moral commitment to doing the right thing. They are the ones who take school very seriously, and their careers seriously, but who will always find time for others at the drop of a text.| I know so many young American Muslims like this, who love to have fun and are constantly laughing and joking with each other, even if to outsiders their humor may seem corny and hardly cynical enough, and even if their taste in movies or books or clothes is often safe and mainstream. These are the young American Muslims who are as confused and disgusted by phenomena like ISIS as everyone else, and they’ve never done anything to support extremism. They consider themselves to be completely American (as you should see them, too) as well as Syrian or Pakistani or Afghan or Palestinian, so they find this constant scrutiny on who they are or what they say or what they wear to be invasive, to say the least.| Over the last decade and a half, a terrible reflex has developed when it comes to discussing anything that happens to Muslims. I’m not even talking about the reflex of blaming all Muslims collectively for the actions of a few individuals. I’m talking about the other reflex that blames Muslims — implicitly or explicitly — for whatever tragedy has befallen them. Muslims are spied on as a group, and when they point out that this is unconstitutional, they’re assumed to be hiding something, as if everybody else has a right to privacy but it’s completely okay to deny it to Muslims.  In February 2014, a federal judge dismissed a lawsuit brought by the Center for Constitutional Rights and others against the New York Police Department for its spying activities. In his 10-page opinion, Judge William J. Martini wrote, “The police could not have monitored New Jersey for Muslim terrorist activities without monitoring the Muslim community itself,” and blamed not the NYPD but the Associated Press for leaking details about police intelligence activities.| Muslims propose to build Islamic Centers around the country and are met with all kinds of opposition (often disguised as objections about “parking,” incidentally). Then the same construction projects, now overblown in significance because of the opposition, are used to “prove” that Muslims are trying to take over the country. That’s what happened in Murfreesboro, Tennessee, for example, where opposition — which included arson, vandalism and loony litigation claiming that Islam isn’t a religion but a cult — delayed the opening of an Islamic Center for two years. In this case, only when a U.S. federal court stepped in did the project proceed, and the same community has since faced renewed opposition over plans for a cemetery.| When Muslims are attacked in the wake of the horrible Charlie Hebdo attacks, you can almost hear the parlor conversations. “Yes, it’s wrong,” the man says to the woman, “but the Muslims, well, they had it coming.”| What’s infuriating about the murder of the three young people in North Carolina is not only their tragic deaths, but also the speed by which the motive of the shooter has been labeled a “parking dispute” by the authorities and the press, as if that explains anything and as if a hate crime or a political crime could not also have a catalyzing event. The question is not whether this was either a hate crime or parking rage. It can be both.| By all accounts, the shooter was always the belligerent one here, and yet the word “dispute” also suggests that the two parties were locked in conflict, as if responsibility is shared. That’s completely ridiculous and duplicitous, and other marginalized groups — LGBT communities, women, African Americans, Latinos, Asian Americans, the poor, and so many more — will recognize the reflex immediately for what it is: a way to displace and justify the violence of the dominant group onto the weaker."}