{"title":"Virtual-Reality Porn Is Coming, and Your Fantasies May Never Be the Same",
"author":"Peter Rubin",
"url":"http://www.wired.com/2015/02/vr-porn/",
"content":"As a kid, Ela Darling fell in love with the idea of virtual reality. This was the late ’90s, early 2000s; Johnny Mnemonic and the Nintendo Virtual Boy had already come and gone, and VR had moved from brain-busting sci-fi concept to schlocky punch line to faded cultural footnote. But still, Darling was an avid reader and D&D player, and the idea of getting lost in an immersive world—“making visual what I was already losing myself in books for,” as she puts it—was something she found not just exciting but romantic.| Not surprisingly for an active reader, Darling went on to get a master’s degree and become a librarian. Perhaps more surprisingly, she then stopped being a librarian and started acting in pornographic movies. (Yes, that means she officially became a sexy librarian. Fun fact: She has the Dewey decimal number for the Harry Potter books tattooed on her back.) And after a few years of bondage scenes, masturbation videos, and girl-on-girl movies, Darling attended the E3 videogame trade show and tried an early version of the Oculus Rift, the headset that jump-started the current VR revolution. “The first thing I think of when I hear of new technology,” she says, “is ‘How can I fuck with it?’ or ‘How can I let people watch me fucking on it?’ Usually there’s one or the other application if you think hard enough.” With Oculus, Darling didn’t have to think too hard at all; now, at 28, she’s busy forging a future as creative director (and star performer) of VRtube, a nascent online studio and distribution center for VR porn.| It’s not just enterprising actresses who think this way. Call it Rule 34a: Whenever a new media technology appears on the horizon, someone pops into a comment thread to say, “I can’t wait to see what the porn industry is gonna do with this.” And indeed, from VCRs to CD-ROMs to streaming video, nearly every home entertainment platform of the past 40 years was either popularized or downright pioneered by companies that could help people watch other people getting freaky. It generally works out well for everyone: If half of all videotapes for sale in the US in the late ’70s hadn’t been X-rated, it might have taken VCRs a lot longer to reach critical mass in the early ’80s.| Yet no visual technology has ever been so perfectly suited to sexual applications as VR. Yes, video brought sexually explicit content from theaters into homes, but virtual reality promises to eclipse even that shift. Historically, we’ve found titillation at a remove. In erotic woodcuts, DVDs, even streaming webcam shows, there’s a frame—whether a book, a Polaroid border, or a screen—through which we experience whatever it is that turns us on. VR is more than just another iteration. It doesn’t just change the frame. VR erases it. It allows us to exist inside the environment. The NSFW possibilities are endless. Yes, we’re at the dawn of this thing, and all the easy points of reference—Star Trek’s holodeck, the Matrix, Community’s Dreamatorium—are years of refinement and R&D away. The real question is what we’ll do in Year One.| Here’s what we’re not going to do: pull a Lawnmower Man. That is, we’re not going to put on full-body haptic suits, climb into gyroscopes, and transform ourselves into shimmering posthuman forms that overcome our bodily shackles and merge with one another in a transcendent liquid singularity. A huge part of the reason VR has finally tipped into mainstream consciousness is that it’s lightweight and low footprint: a headset display, some sort of input controller, and sound. Sure, the libidinally aspirational can shell out for omnidirectional treadmills and mo-cap harnesses to facilitate Peak Air-Hump. Japanese sex-toy company Tenga has even helped design a complicated prototype that syncs a virtual sex simulator with … well, you can imagine with what. But for the foreseeable future, VR will be aural and visual only; if localized tactile feedback is what you’re after, you’re gonna need to handle that yourself. (Good riddance, “teledildonics.” You’re the worst word ever, and you’ll be despised long after your passing.)| We’re also not going to lose ourselves in a panoply of CGI flesh calibrated to our every kink and whim. Not that ­people ­haven’t tried: The past two years of VR game development are littered with the husks of abandoned projects with names like Sinful Robot. The problem is, as their developers learned, creating a fluid 360-degree video­game is already difficult—and making it stereo­scopic and photo-realistic complicates things exponentially. Players can handle the janky facial animations in an action game like Far Cry 4 because they’re secondary to the purpose of the game (i.e., Shoot Everything). Certainly, depictions of sex can be arousing at low fidelity, as erotic comic books and vast swaths of hentai anime suggest. But obliterate the proscenium the way VR does and suddenly those lossy signals lead straight to the uncanny valley, that very unsexy place where things look sorta real but not real at all. The vast majority of VR-­capable “adult games” are Second Life–like knockoffs with graphics that look like waxy (and waxed) blow-up dolls. While a VR version of phone or FaceTime sex isn’t tenable yet—even if you could see each other, you’d have headsets on—the most promising avenue appears to be 360-degree 3-D video, like the kind some people are using to produce VR concert experiences or the projects showcased at Sundance’s New Frontiers program in January.| Regardless, what we are going to do is find something virtually (sorry) unheard-of in pornography: intimacy. The thing that’s going to take us there is “presence,” that phenomenon that occurs when head-tracking latency, screen quality, and processing wizardry combine to trick your brain into thinking that you’re existing in a virtual space, rather than just watching a screen that extends past the edges of your vision. If your brain believes it, your body reacts in kind—with all the responses that come along with that.| So if you’re standing at the edge of a skyscraper in VR and you lean over the side, you experience vertigo. If you’re in a darkened corridor on an alien spaceship and you hear a rustle behind you, you freak the fuck out—full, heart-pounding fight-or-flight response. If you’re sitting in a musician’s apartment while he noodles on a piano, his dog sleeping behind you on the hardwood floor, you feel serene. (This isn’t speculation; I’ve done all those things in various VR environments—some CG, some video—and I’ve had all those reactions.)| The big question is whether sexual content in VR will induce the same reptile-brain response. Ela Darling would certainly like to know. She found like-minded colleagues last year when they posted on Reddit about wanting to make VR porn. They flew her from California to Maryland last April; in true tech startup fashion, they turned out to be 20-year-old college students. (“It was very Weird Science,” Darling says.) Nonetheless, they shot a test scene in their dorm room. Rather than invest in an array of pricey high-end Red cameras like many other fledgling VR video companies, they went decidedly DIY, taping together two GoPro cameras to create a stereo­scopic 3-D image with a wide field of view on the cheap. (Again in true tech startup fashion, Darling initially wore an R2-D2 swimsuit.) After she flew back to LA, one of the students emailed her; he’d finished processing the test scene and was so blown away by the result that he wanted her to be a partner in the venture. “This is unlike any porn I’ve seen,” he wrote. “It’s like I’m watching an actual person.”| That’s a lot of quote to unpack. The subtext suggests that things critics of porn say are true—that it dehumanizes its actors. But pornography has always been fantasy: the fantasy of abandon, of the exotic, of being desired. For years, the adult industry has catered to that fantasy by producing a genre called POV, in which an actor holds a camera or a camera operator films over a performer’s shoulder; it’s meant to create the illusion that the viewer is a participant rather than a voyeur. But beneath that illusion is the awareness that it’s just that—an illusion. In VR, the frame of detachment disappears, and fantasy effectively does too. You’re not watching a scene anymore; you’re inhabiting it. And by being there, you’re implicated in whatever’s happening.| Does that make things more arousing? More awkward? It depends on the scene. It depends on the person watching it. But that potential to put viewers on equal footing with the fantasy they wanted to see promises to upend pornography in a way no one has considered. Nearly a year after they shot that test footage, Darling and her partner are hard at work perfecting a new iteration of their filming rig—they’re still chasing the elusive 360-degree immersion and at press time were shooting for a springtime relaunch of their site—but she knows they’re on the right track. And she’s ready for the revolution. “I’ve got notebooks full of porn ideas that I’ve kept for years,” she says. “And with a lot of it, I’m now realizing it depends on cinematography that I can’t apply to this. This requires an entirely new approach.”"}